version 1.0;

extension tract_registry tract_core;

graph net_2024_08_13T15_38_49(input_0) -> (output_0)
{
    input_0 = tract_core_external(shape = [2, 2, 17, 2], datum_type = 'f32');
    param = variable<scalar>(label = 'param', shape = [2, 1, 1]);
    param_aligned_rank_expanded = unsqueeze(param, axes = [0]);
    output_0 = mul(input_0, param_aligned_rank_expanded);
}
