version 1.0;

fragment tract_core_properties(
) -> (properties: (string, tensor<scalar>)[])
{
  properties = [("tract_nnef_ser_version", "0.18.3-pre"), ("tract_nnef_format_version", "beta1")];
}

graph network(input) -> (output) {
  input = external(shape = [1, 1, 3]);
  output_weigths = variable<scalar>(label = "output_weigths", shape = [2, 1, 3]);
  output_conv = conv(input, output_weigths, [1.0, 1.0], dilation = [1], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  output = output_conv;
}
