version 1.0;

graph check_bias_loading(input) -> (output)
{
    input = external<scalar>(shape = [1, 1, 3]);
    kernel1 = [[[0.0, 0.0, 0.0]], [[0.0, 0.0, 0.0]]];
    bias1 = [[[1.0, 1.0]]];
    output = conv(input, kernel1, bias1, padding = [(0, 0)], border = 'constant', stride = [1], dilation = [1]);
}
