version 1.0;

extension tract_registry tract_core;

fragment tract_core_properties(
) -> (properties: (string, tensor<scalar>)[])
{
  properties = [("tract_nnef_ser_version", "0.18.3-pre"), ("tract_nnef_format_version", "beta1")];
}

graph network(input) -> (output) {
  input = external(shape = [1, 2, 2]);
  default_state = tract_core_cast([[[0, 0], [0, 0]]], to = "i32");
  state = load(default_state, id = "state-0");
  v2_linear_output = tract_core_einsum([input, state], expr = "amk,ank->amn", acc = "f32", output = "");
  output = force_eval([v2_linear_output], slots = [1]);
}
