version 1.0;

graph net_2022_04_13T13_03_40(input_0) -> (output_0)
{
    input_0 = external<scalar>(shape = [2, 1, 3]);
    v3_weight = [[[0.0, 0.0, 0.0],[0.0,0.0,0.0],[0.0,0.0,0.0]]];
    v2 = linear(input_0, v3_weight);
    output_0 = add(v2, input_0);
}
