version 1.0;

extension tract_registry tract_core;

fragment tract_core_properties(
) -> (properties: (string, tensor<scalar>)[])
{
  properties = [("tract_nnef_ser_version", "0.21.2-pre"), ("tract_nnef_format_version", "beta1")];
}

graph network(input) -> (output) {
  input = external(shape = [2, 1, 3]);
  output_relu_y_3 = variable<scalar>(label = "output_relu_y_3", shape = [1, 1, 1]);
  output_raw = max(input, output_relu_y_3);
  foo = tract_core_cast(output_raw, to = "u8");
  output = foo;
}
