version 1.0;

fragment tract_core_properties(
) -> (properties: (string, tensor<scalar>)[])
{
  properties = [("tract_nnef_format_version", "beta1"), ("tract_nnef_ser_version", "0.18.4"), ("tract_nnef_ser_version", "0.18.4"), ("tract_nnef_format_version", "beta1")];
}

graph network( input ) -> ( output ) {
  input = external(shape = [1, 2, 3]);
  conv_weights = [[[0, 0, 0], [0, 0, 0]]];
  conv_bias = [[[1]]];
  output_conv = conv(input, conv_weights, conv_bias, dilation = [1], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  output = output_conv;
}
