version 1.0;

graph rm_softmax_add(input) -> (output)
{
    input = external<scalar>(shape = [2, 1, 3]);
    tmp1 = squeeze( input, axes = [1] );
    softmax1 = softmax( tmp1, axes = [1] );
    output = unsqueeze( softmax1, axes = [1] );
}
