version 1.0;

extension tract_registry tract_core;
extension tract_registry tract_pulse;
extension tract_symbol S;

fragment tract_core_properties(
) -> (properties: (string, tensor<scalar>)[])
{
  properties = [("pulse.delay", tract_core_cast([182], to = "i64")), ("pulse.input_axes", tract_core_cast([0], to = "i64")), ("pulse.output_axes", tract_core_cast([0], to = "i64")), ("tract_nnef_ser_version", "0.19.3-pre"), ("tract_nnef_format_version", "beta1")];
}

graph network(input_node) -> (i"wavenet_2/post_proc_2-1x1_conv-conv1d/convolution/Conv2D") {
  input_node = external(shape = [8, 20]);
  i"wavenet_2/input_batch_normalisation/batchnorm/mul.fix-rank-1-2" = variable<scalar>(label = "wavenet_2/input_batch_normalisation/batchnorm/mul.fix-rank-1-2", shape = [1, 20]);
  i"wavenet_2/input_batch_normalisation/batchnorm/mul" = mul(input_node, i"wavenet_2/input_batch_normalisation/batchnorm/mul.fix-rank-1-2");
  i"wavenet_2/input_batch_normalisation/batchnorm/add_1.fix-rank-1-2" = variable<scalar>(label = "wavenet_2/input_batch_normalisation/batchnorm/add_1.fix-rank-1-2", shape = [1, 20]);
  i"wavenet_2/input_batch_normalisation/batchnorm/add_1" = add(i"wavenet_2/input_batch_normalisation/batchnorm/mul", i"wavenet_2/input_batch_normalisation/batchnorm/add_1.fix-rank-1-2");
  i"wavenet_2/pre_conv-conv1d/convolution/Conv2D.delay" = tract_pulse_delay(i"wavenet_2/input_batch_normalisation/batchnorm/add_1", axis = 0, delay = 0, overlap = 2);
  i"wavenet_2/pre_conv-conv1d/convolution/Conv2D.add_n" = unsqueeze(i"wavenet_2/pre_conv-conv1d/convolution/Conv2D.delay", axes = [0]);
  i"wavenet_2/pre_conv-conv1d/convolution/Conv2D.kernel_reorg_go" = variable<scalar>(label = "wavenet_2/pre_conv-conv1d/convolution/Conv2D.kernel_reorg_go", shape = [16, 20, 3]);
  i"wavenet_2/pre_conv-conv1d/convolution/Conv2D.bias" = 0.0;
  i"wavenet_2/pre_conv-conv1d/convolution/Conv2D_input" = transpose(i"wavenet_2/pre_conv-conv1d/convolution/Conv2D.add_n", axes = [0, 2, 1]);
  i"wavenet_2/pre_conv-conv1d/convolution/Conv2D_conv" = conv(i"wavenet_2/pre_conv-conv1d/convolution/Conv2D_input", i"wavenet_2/pre_conv-conv1d/convolution/Conv2D.kernel_reorg_go", i"wavenet_2/pre_conv-conv1d/convolution/Conv2D.bias", dilation = [1], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"wavenet_2/pre_conv-conv1d/convolution/Conv2D" = transpose(i"wavenet_2/pre_conv-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]);
  i"wavenet_2/pre_conv-conv1d/convolution/Conv2D.rm_n" = squeeze(i"wavenet_2/pre_conv-conv1d/convolution/Conv2D", axes = [0]);
  i"wavenet_2/dilation_layer_0-dilation_rate_1-filter-conv1d/convolution/Conv2D.delay" = tract_pulse_delay(i"wavenet_2/pre_conv-conv1d/convolution/Conv2D.rm_n", axis = 0, delay = 0, overlap = 2);
  i"wavenet_2/dilation_layer_0-dilation_rate_1-filter-conv1d/convolution/Conv2D.add_n" = unsqueeze(i"wavenet_2/dilation_layer_0-dilation_rate_1-filter-conv1d/convolution/Conv2D.delay", axes = [0]);
  i"wavenet_2/dilation_layer_0-dilation_rate_1-filter-conv1d/convolution/Conv2D.kernel_reorg_go" = variable<scalar>(label = "wavenet_2/dilation_layer_0-dilation_rate_1-filter-conv1d/convolution/Conv2D.kernel_reorg_go", shape = [64, 16, 3]);
  i"wavenet_2/dilation_layer_0-dilation_rate_1-filter-conv1d/convolution/Conv2D_input" = transpose(i"wavenet_2/dilation_layer_0-dilation_rate_1-filter-conv1d/convolution/Conv2D.add_n", axes = [0, 2, 1]);
  i"wavenet_2/dilation_layer_0-dilation_rate_1-filter-conv1d/convolution/Conv2D_conv" = conv(i"wavenet_2/dilation_layer_0-dilation_rate_1-filter-conv1d/convolution/Conv2D_input", i"wavenet_2/dilation_layer_0-dilation_rate_1-filter-conv1d/convolution/Conv2D.kernel_reorg_go", i"wavenet_2/pre_conv-conv1d/convolution/Conv2D.bias", dilation = [1], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"wavenet_2/dilation_layer_0-dilation_rate_1-filter-conv1d/convolution/Conv2D" = transpose(i"wavenet_2/dilation_layer_0-dilation_rate_1-filter-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]);
  i"wavenet_2/dilation_layer_0-dilation_rate_1-filter-conv1d/convolution/Conv2D.rm_n" = squeeze(i"wavenet_2/dilation_layer_0-dilation_rate_1-filter-conv1d/convolution/Conv2D", axes = [0]);
  i"wavenet_2/dilation_layer_0-dilation_rate_1-filter-conv1d/Tanh" = tanh(i"wavenet_2/dilation_layer_0-dilation_rate_1-filter-conv1d/convolution/Conv2D.rm_n");
  i"wavenet_2/dilation_layer_0-dilation_rate_1-gate-conv1d/convolution/Conv2D.add_n" = unsqueeze(i"wavenet_2/dilation_layer_0-dilation_rate_1-filter-conv1d/convolution/Conv2D.delay", axes = [0]);
  i"wavenet_2/dilation_layer_0-dilation_rate_1-gate-conv1d/convolution/Conv2D.kernel_reorg_go" = variable<scalar>(label = "wavenet_2/dilation_layer_0-dilation_rate_1-gate-conv1d/convolution/Conv2D.kernel_reorg_go", shape = [64, 16, 3]);
  i"wavenet_2/dilation_layer_0-dilation_rate_1-gate-conv1d/convolution/Conv2D_input" = transpose(i"wavenet_2/dilation_layer_0-dilation_rate_1-gate-conv1d/convolution/Conv2D.add_n", axes = [0, 2, 1]);
  i"wavenet_2/dilation_layer_0-dilation_rate_1-gate-conv1d/convolution/Conv2D_conv" = conv(i"wavenet_2/dilation_layer_0-dilation_rate_1-gate-conv1d/convolution/Conv2D_input", i"wavenet_2/dilation_layer_0-dilation_rate_1-gate-conv1d/convolution/Conv2D.kernel_reorg_go", i"wavenet_2/pre_conv-conv1d/convolution/Conv2D.bias", dilation = [1], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"wavenet_2/dilation_layer_0-dilation_rate_1-gate-conv1d/convolution/Conv2D" = transpose(i"wavenet_2/dilation_layer_0-dilation_rate_1-gate-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]);
  i"wavenet_2/dilation_layer_0-dilation_rate_1-gate-conv1d/convolution/Conv2D.rm_n" = squeeze(i"wavenet_2/dilation_layer_0-dilation_rate_1-gate-conv1d/convolution/Conv2D", axes = [0]);
  i"wavenet_2/dilation_layer_0-dilation_rate_1-gate-conv1d/Sigmoid" = sigmoid(i"wavenet_2/dilation_layer_0-dilation_rate_1-gate-conv1d/convolution/Conv2D.rm_n");
  i"wavenet_2/mul" = mul(i"wavenet_2/dilation_layer_0-dilation_rate_1-filter-conv1d/Tanh", i"wavenet_2/dilation_layer_0-dilation_rate_1-gate-conv1d/Sigmoid");
  i"wavenet_2/dilation_layer_0-dilation_rate_1-1x1_conv_skip-conv1d/convolution/Conv2D.filters_as_co_ci" = variable<scalar>(label = "wavenet_2/dilation_layer_0-dilation_rate_1-1x1_conv_skip-conv1d/convolution/Conv2D.filters_as_co_ci", shape = [32, 64]);
  i"wavenet_2/dilation_layer_0-dilation_rate_1-1x1_conv_skip-conv1d/convolution/Conv2D.split-over-2.178..S+-4" = matmul(i"wavenet_2/mul", i"wavenet_2/dilation_layer_0-dilation_rate_1-1x1_conv_skip-conv1d/convolution/Conv2D.filters_as_co_ci", transposeA = false, transposeB = true);
  i"wavenet_2/dilation_layer_0-dilation_rate_1-1x1_conv_transform-conv1d/convolution/Conv2D.filters_as_co_ci" = variable<scalar>(label = "wavenet_2/dilation_layer_0-dilation_rate_1-1x1_conv_transform-conv1d/convolution/Conv2D.filters_as_co_ci", shape = [16, 64]);
  i"wavenet_2/dilation_layer_0-dilation_rate_1-1x1_conv_transform-conv1d/convolution/Conv2D" = matmul(i"wavenet_2/mul", i"wavenet_2/dilation_layer_0-dilation_rate_1-1x1_conv_transform-conv1d/convolution/Conv2D.filters_as_co_ci", transposeA = false, transposeB = true);
  i"wavenet_2/add" = add(i"wavenet_2/dilation_layer_0-dilation_rate_1-1x1_conv_transform-conv1d/convolution/Conv2D", i"wavenet_2/pre_conv-conv1d/convolution/Conv2D.rm_n");
  i"wavenet_2/dilation_layer_1-dilation_rate_2-filter-conv1d/convolution/Conv2D.delay" = tract_pulse_delay(i"wavenet_2/add", axis = 0, delay = 0, overlap = 4);
  i"wavenet_2/dilation_layer_1-dilation_rate_2-filter-conv1d/convolution/Conv2D.add_n" = unsqueeze(i"wavenet_2/dilation_layer_1-dilation_rate_2-filter-conv1d/convolution/Conv2D.delay", axes = [0]);
  i"wavenet_2/dilation_layer_1-dilation_rate_2-filter-conv1d/convolution/Conv2D.kernel_reorg_go" = variable<scalar>(label = "wavenet_2/dilation_layer_1-dilation_rate_2-filter-conv1d/convolution/Conv2D.kernel_reorg_go", shape = [64, 16, 3]);
  i"wavenet_2/dilation_layer_1-dilation_rate_2-filter-conv1d/convolution/Conv2D_input" = transpose(i"wavenet_2/dilation_layer_1-dilation_rate_2-filter-conv1d/convolution/Conv2D.add_n", axes = [0, 2, 1]);
  i"wavenet_2/dilation_layer_1-dilation_rate_2-filter-conv1d/convolution/Conv2D_conv" = conv(i"wavenet_2/dilation_layer_1-dilation_rate_2-filter-conv1d/convolution/Conv2D_input", i"wavenet_2/dilation_layer_1-dilation_rate_2-filter-conv1d/convolution/Conv2D.kernel_reorg_go", i"wavenet_2/pre_conv-conv1d/convolution/Conv2D.bias", dilation = [2], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"wavenet_2/dilation_layer_1-dilation_rate_2-filter-conv1d/convolution/Conv2D" = transpose(i"wavenet_2/dilation_layer_1-dilation_rate_2-filter-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]);
  i"wavenet_2/dilation_layer_1-dilation_rate_2-filter-conv1d/convolution/Conv2D.rm_n" = squeeze(i"wavenet_2/dilation_layer_1-dilation_rate_2-filter-conv1d/convolution/Conv2D", axes = [0]);
  i"wavenet_2/dilation_layer_1-dilation_rate_2-filter-conv1d/Tanh" = tanh(i"wavenet_2/dilation_layer_1-dilation_rate_2-filter-conv1d/convolution/Conv2D.rm_n");
  i"wavenet_2/dilation_layer_1-dilation_rate_2-gate-conv1d/convolution/Conv2D.add_n" = unsqueeze(i"wavenet_2/dilation_layer_1-dilation_rate_2-filter-conv1d/convolution/Conv2D.delay", axes = [0]);
  i"wavenet_2/dilation_layer_1-dilation_rate_2-gate-conv1d/convolution/Conv2D.kernel_reorg_go" = variable<scalar>(label = "wavenet_2/dilation_layer_1-dilation_rate_2-gate-conv1d/convolution/Conv2D.kernel_reorg_go", shape = [64, 16, 3]);
  i"wavenet_2/dilation_layer_1-dilation_rate_2-gate-conv1d/convolution/Conv2D_input" = transpose(i"wavenet_2/dilation_layer_1-dilation_rate_2-gate-conv1d/convolution/Conv2D.add_n", axes = [0, 2, 1]);
  i"wavenet_2/dilation_layer_1-dilation_rate_2-gate-conv1d/convolution/Conv2D_conv" = conv(i"wavenet_2/dilation_layer_1-dilation_rate_2-gate-conv1d/convolution/Conv2D_input", i"wavenet_2/dilation_layer_1-dilation_rate_2-gate-conv1d/convolution/Conv2D.kernel_reorg_go", i"wavenet_2/pre_conv-conv1d/convolution/Conv2D.bias", dilation = [2], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"wavenet_2/dilation_layer_1-dilation_rate_2-gate-conv1d/convolution/Conv2D" = transpose(i"wavenet_2/dilation_layer_1-dilation_rate_2-gate-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]);
  i"wavenet_2/dilation_layer_1-dilation_rate_2-gate-conv1d/convolution/Conv2D.rm_n" = squeeze(i"wavenet_2/dilation_layer_1-dilation_rate_2-gate-conv1d/convolution/Conv2D", axes = [0]);
  i"wavenet_2/dilation_layer_1-dilation_rate_2-gate-conv1d/Sigmoid" = sigmoid(i"wavenet_2/dilation_layer_1-dilation_rate_2-gate-conv1d/convolution/Conv2D.rm_n");
  i"wavenet_2/mul_1" = mul(i"wavenet_2/dilation_layer_1-dilation_rate_2-filter-conv1d/Tanh", i"wavenet_2/dilation_layer_1-dilation_rate_2-gate-conv1d/Sigmoid");
  i"wavenet_2/dilation_layer_1-dilation_rate_2-1x1_conv_skip-conv1d/convolution/Conv2D.filters_as_co_ci" = variable<scalar>(label = "wavenet_2/dilation_layer_1-dilation_rate_2-1x1_conv_skip-conv1d/convolution/Conv2D.filters_as_co_ci", shape = [32, 64]);
  i"wavenet_2/dilation_layer_1-dilation_rate_2-1x1_conv_skip-conv1d/convolution/Conv2D.split-over-2.174..S+-8" = matmul(i"wavenet_2/mul_1", i"wavenet_2/dilation_layer_1-dilation_rate_2-1x1_conv_skip-conv1d/convolution/Conv2D.filters_as_co_ci", transposeA = false, transposeB = true);
  i"wavenet_2/AddN.0" = add(i"wavenet_2/dilation_layer_0-dilation_rate_1-1x1_conv_skip-conv1d/convolution/Conv2D.split-over-2.178..S+-4", i"wavenet_2/dilation_layer_1-dilation_rate_2-1x1_conv_skip-conv1d/convolution/Conv2D.split-over-2.174..S+-8");
  i"wavenet_2/dilation_layer_1-dilation_rate_2-1x1_conv_transform-conv1d/convolution/Conv2D.filters_as_co_ci" = variable<scalar>(label = "wavenet_2/dilation_layer_1-dilation_rate_2-1x1_conv_transform-conv1d/convolution/Conv2D.filters_as_co_ci", shape = [16, 64]);
  i"wavenet_2/dilation_layer_1-dilation_rate_2-1x1_conv_transform-conv1d/convolution/Conv2D" = matmul(i"wavenet_2/mul_1", i"wavenet_2/dilation_layer_1-dilation_rate_2-1x1_conv_transform-conv1d/convolution/Conv2D.filters_as_co_ci", transposeA = false, transposeB = true);
  i"wavenet_2/add_1" = add(i"wavenet_2/dilation_layer_1-dilation_rate_2-1x1_conv_transform-conv1d/convolution/Conv2D", i"wavenet_2/add");
  i"wavenet_2/dilation_layer_2-dilation_rate_4-filter-conv1d/convolution/Conv2D.delay" = tract_pulse_delay(i"wavenet_2/add_1", axis = 0, delay = 0, overlap = 8);
  i"wavenet_2/dilation_layer_2-dilation_rate_4-filter-conv1d/convolution/Conv2D.add_n" = unsqueeze(i"wavenet_2/dilation_layer_2-dilation_rate_4-filter-conv1d/convolution/Conv2D.delay", axes = [0]);
  i"wavenet_2/dilation_layer_2-dilation_rate_4-filter-conv1d/convolution/Conv2D.kernel_reorg_go" = variable<scalar>(label = "wavenet_2/dilation_layer_2-dilation_rate_4-filter-conv1d/convolution/Conv2D.kernel_reorg_go", shape = [64, 16, 3]);
  i"wavenet_2/dilation_layer_2-dilation_rate_4-filter-conv1d/convolution/Conv2D_input" = transpose(i"wavenet_2/dilation_layer_2-dilation_rate_4-filter-conv1d/convolution/Conv2D.add_n", axes = [0, 2, 1]);
  i"wavenet_2/dilation_layer_2-dilation_rate_4-filter-conv1d/convolution/Conv2D_conv" = conv(i"wavenet_2/dilation_layer_2-dilation_rate_4-filter-conv1d/convolution/Conv2D_input", i"wavenet_2/dilation_layer_2-dilation_rate_4-filter-conv1d/convolution/Conv2D.kernel_reorg_go", i"wavenet_2/pre_conv-conv1d/convolution/Conv2D.bias", dilation = [4], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"wavenet_2/dilation_layer_2-dilation_rate_4-filter-conv1d/convolution/Conv2D" = transpose(i"wavenet_2/dilation_layer_2-dilation_rate_4-filter-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]);
  i"wavenet_2/dilation_layer_2-dilation_rate_4-filter-conv1d/convolution/Conv2D.rm_n" = squeeze(i"wavenet_2/dilation_layer_2-dilation_rate_4-filter-conv1d/convolution/Conv2D", axes = [0]);
  i"wavenet_2/dilation_layer_2-dilation_rate_4-filter-conv1d/Tanh" = tanh(i"wavenet_2/dilation_layer_2-dilation_rate_4-filter-conv1d/convolution/Conv2D.rm_n");
  i"wavenet_2/dilation_layer_2-dilation_rate_4-gate-conv1d/convolution/Conv2D.add_n" = unsqueeze(i"wavenet_2/dilation_layer_2-dilation_rate_4-filter-conv1d/convolution/Conv2D.delay", axes = [0]);
  i"wavenet_2/dilation_layer_2-dilation_rate_4-gate-conv1d/convolution/Conv2D.kernel_reorg_go" = variable<scalar>(label = "wavenet_2/dilation_layer_2-dilation_rate_4-gate-conv1d/convolution/Conv2D.kernel_reorg_go", shape = [64, 16, 3]);
  i"wavenet_2/dilation_layer_2-dilation_rate_4-gate-conv1d/convolution/Conv2D_input" = transpose(i"wavenet_2/dilation_layer_2-dilation_rate_4-gate-conv1d/convolution/Conv2D.add_n", axes = [0, 2, 1]);
  i"wavenet_2/dilation_layer_2-dilation_rate_4-gate-conv1d/convolution/Conv2D_conv" = conv(i"wavenet_2/dilation_layer_2-dilation_rate_4-gate-conv1d/convolution/Conv2D_input", i"wavenet_2/dilation_layer_2-dilation_rate_4-gate-conv1d/convolution/Conv2D.kernel_reorg_go", i"wavenet_2/pre_conv-conv1d/convolution/Conv2D.bias", dilation = [4], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"wavenet_2/dilation_layer_2-dilation_rate_4-gate-conv1d/convolution/Conv2D" = transpose(i"wavenet_2/dilation_layer_2-dilation_rate_4-gate-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]);
  i"wavenet_2/dilation_layer_2-dilation_rate_4-gate-conv1d/convolution/Conv2D.rm_n" = squeeze(i"wavenet_2/dilation_layer_2-dilation_rate_4-gate-conv1d/convolution/Conv2D", axes = [0]);
  i"wavenet_2/dilation_layer_2-dilation_rate_4-gate-conv1d/Sigmoid" = sigmoid(i"wavenet_2/dilation_layer_2-dilation_rate_4-gate-conv1d/convolution/Conv2D.rm_n");
  i"wavenet_2/mul_2" = mul(i"wavenet_2/dilation_layer_2-dilation_rate_4-filter-conv1d/Tanh", i"wavenet_2/dilation_layer_2-dilation_rate_4-gate-conv1d/Sigmoid");
  i"wavenet_2/dilation_layer_2-dilation_rate_4-1x1_conv_skip-conv1d/convolution/Conv2D.filters_as_co_ci" = variable<scalar>(label = "wavenet_2/dilation_layer_2-dilation_rate_4-1x1_conv_skip-conv1d/convolution/Conv2D.filters_as_co_ci", shape = [32, 64]);
  i"wavenet_2/dilation_layer_2-dilation_rate_4-1x1_conv_skip-conv1d/convolution/Conv2D.split-over-2.166..S+-16" = matmul(i"wavenet_2/mul_2", i"wavenet_2/dilation_layer_2-dilation_rate_4-1x1_conv_skip-conv1d/convolution/Conv2D.filters_as_co_ci", transposeA = false, transposeB = true);
  i"wavenet_2/AddN.1" = add(i"wavenet_2/AddN.0", i"wavenet_2/dilation_layer_2-dilation_rate_4-1x1_conv_skip-conv1d/convolution/Conv2D.split-over-2.166..S+-16");
  i"wavenet_2/dilation_layer_2-dilation_rate_4-1x1_conv_transform-conv1d/convolution/Conv2D.filters_as_co_ci" = variable<scalar>(label = "wavenet_2/dilation_layer_2-dilation_rate_4-1x1_conv_transform-conv1d/convolution/Conv2D.filters_as_co_ci", shape = [16, 64]);
  i"wavenet_2/dilation_layer_2-dilation_rate_4-1x1_conv_transform-conv1d/convolution/Conv2D" = matmul(i"wavenet_2/mul_2", i"wavenet_2/dilation_layer_2-dilation_rate_4-1x1_conv_transform-conv1d/convolution/Conv2D.filters_as_co_ci", transposeA = false, transposeB = true);
  i"wavenet_2/add_2" = add(i"wavenet_2/dilation_layer_2-dilation_rate_4-1x1_conv_transform-conv1d/convolution/Conv2D", i"wavenet_2/add_1");
  i"wavenet_2/dilation_layer_3-dilation_rate_8-filter-conv1d/convolution/Conv2D.delay" = tract_pulse_delay(i"wavenet_2/add_2", axis = 0, delay = 0, overlap = 16);
  i"wavenet_2/dilation_layer_3-dilation_rate_8-filter-conv1d/convolution/Conv2D.add_n" = unsqueeze(i"wavenet_2/dilation_layer_3-dilation_rate_8-filter-conv1d/convolution/Conv2D.delay", axes = [0]);
  i"wavenet_2/dilation_layer_3-dilation_rate_8-filter-conv1d/convolution/Conv2D.kernel_reorg_go" = variable<scalar>(label = "wavenet_2/dilation_layer_3-dilation_rate_8-filter-conv1d/convolution/Conv2D.kernel_reorg_go", shape = [64, 16, 3]);
  i"wavenet_2/dilation_layer_3-dilation_rate_8-filter-conv1d/convolution/Conv2D_input" = transpose(i"wavenet_2/dilation_layer_3-dilation_rate_8-filter-conv1d/convolution/Conv2D.add_n", axes = [0, 2, 1]);
  i"wavenet_2/dilation_layer_3-dilation_rate_8-filter-conv1d/convolution/Conv2D_conv" = conv(i"wavenet_2/dilation_layer_3-dilation_rate_8-filter-conv1d/convolution/Conv2D_input", i"wavenet_2/dilation_layer_3-dilation_rate_8-filter-conv1d/convolution/Conv2D.kernel_reorg_go", i"wavenet_2/pre_conv-conv1d/convolution/Conv2D.bias", dilation = [8], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"wavenet_2/dilation_layer_3-dilation_rate_8-filter-conv1d/convolution/Conv2D" = transpose(i"wavenet_2/dilation_layer_3-dilation_rate_8-filter-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]);
  i"wavenet_2/dilation_layer_3-dilation_rate_8-filter-conv1d/convolution/Conv2D.rm_n" = squeeze(i"wavenet_2/dilation_layer_3-dilation_rate_8-filter-conv1d/convolution/Conv2D", axes = [0]);
  i"wavenet_2/dilation_layer_3-dilation_rate_8-filter-conv1d/Tanh" = tanh(i"wavenet_2/dilation_layer_3-dilation_rate_8-filter-conv1d/convolution/Conv2D.rm_n");
  i"wavenet_2/dilation_layer_3-dilation_rate_8-gate-conv1d/convolution/Conv2D.add_n" = unsqueeze(i"wavenet_2/dilation_layer_3-dilation_rate_8-filter-conv1d/convolution/Conv2D.delay", axes = [0]);
  i"wavenet_2/dilation_layer_3-dilation_rate_8-gate-conv1d/convolution/Conv2D.kernel_reorg_go" = variable<scalar>(label = "wavenet_2/dilation_layer_3-dilation_rate_8-gate-conv1d/convolution/Conv2D.kernel_reorg_go", shape = [64, 16, 3]);
  i"wavenet_2/dilation_layer_3-dilation_rate_8-gate-conv1d/convolution/Conv2D_input" = transpose(i"wavenet_2/dilation_layer_3-dilation_rate_8-gate-conv1d/convolution/Conv2D.add_n", axes = [0, 2, 1]);
  i"wavenet_2/dilation_layer_3-dilation_rate_8-gate-conv1d/convolution/Conv2D_conv" = conv(i"wavenet_2/dilation_layer_3-dilation_rate_8-gate-conv1d/convolution/Conv2D_input", i"wavenet_2/dilation_layer_3-dilation_rate_8-gate-conv1d/convolution/Conv2D.kernel_reorg_go", i"wavenet_2/pre_conv-conv1d/convolution/Conv2D.bias", dilation = [8], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"wavenet_2/dilation_layer_3-dilation_rate_8-gate-conv1d/convolution/Conv2D" = transpose(i"wavenet_2/dilation_layer_3-dilation_rate_8-gate-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]);
  i"wavenet_2/dilation_layer_3-dilation_rate_8-gate-conv1d/convolution/Conv2D.rm_n" = squeeze(i"wavenet_2/dilation_layer_3-dilation_rate_8-gate-conv1d/convolution/Conv2D", axes = [0]);
  i"wavenet_2/dilation_layer_3-dilation_rate_8-gate-conv1d/Sigmoid" = sigmoid(i"wavenet_2/dilation_layer_3-dilation_rate_8-gate-conv1d/convolution/Conv2D.rm_n");
  i"wavenet_2/mul_3" = mul(i"wavenet_2/dilation_layer_3-dilation_rate_8-filter-conv1d/Tanh", i"wavenet_2/dilation_layer_3-dilation_rate_8-gate-conv1d/Sigmoid");
  i"wavenet_2/dilation_layer_3-dilation_rate_8-1x1_conv_skip-conv1d/convolution/Conv2D.filters_as_co_ci" = variable<scalar>(label = "wavenet_2/dilation_layer_3-dilation_rate_8-1x1_conv_skip-conv1d/convolution/Conv2D.filters_as_co_ci", shape = [32, 64]);
  i"wavenet_2/dilation_layer_3-dilation_rate_8-1x1_conv_skip-conv1d/convolution/Conv2D.split-over-2.150..S+-32" = matmul(i"wavenet_2/mul_3", i"wavenet_2/dilation_layer_3-dilation_rate_8-1x1_conv_skip-conv1d/convolution/Conv2D.filters_as_co_ci", transposeA = false, transposeB = true);
  i"wavenet_2/AddN.2" = add(i"wavenet_2/AddN.1", i"wavenet_2/dilation_layer_3-dilation_rate_8-1x1_conv_skip-conv1d/convolution/Conv2D.split-over-2.150..S+-32");
  i"wavenet_2/dilation_layer_3-dilation_rate_8-1x1_conv_transform-conv1d/convolution/Conv2D.filters_as_co_ci" = variable<scalar>(label = "wavenet_2/dilation_layer_3-dilation_rate_8-1x1_conv_transform-conv1d/convolution/Conv2D.filters_as_co_ci", shape = [16, 64]);
  i"wavenet_2/dilation_layer_3-dilation_rate_8-1x1_conv_transform-conv1d/convolution/Conv2D" = matmul(i"wavenet_2/mul_3", i"wavenet_2/dilation_layer_3-dilation_rate_8-1x1_conv_transform-conv1d/convolution/Conv2D.filters_as_co_ci", transposeA = false, transposeB = true);
  i"wavenet_2/add_3" = add(i"wavenet_2/dilation_layer_3-dilation_rate_8-1x1_conv_transform-conv1d/convolution/Conv2D", i"wavenet_2/add_2");
  i"wavenet_2/dilation_layer_4-dilation_rate_1-filter-conv1d/convolution/Conv2D.delay" = tract_pulse_delay(i"wavenet_2/add_3", axis = 0, delay = 0, overlap = 2);
  i"wavenet_2/dilation_layer_4-dilation_rate_1-filter-conv1d/convolution/Conv2D.add_n" = unsqueeze(i"wavenet_2/dilation_layer_4-dilation_rate_1-filter-conv1d/convolution/Conv2D.delay", axes = [0]);
  i"wavenet_2/dilation_layer_4-dilation_rate_1-filter-conv1d/convolution/Conv2D.kernel_reorg_go" = variable<scalar>(label = "wavenet_2/dilation_layer_4-dilation_rate_1-filter-conv1d/convolution/Conv2D.kernel_reorg_go", shape = [64, 16, 3]);
  i"wavenet_2/dilation_layer_4-dilation_rate_1-filter-conv1d/convolution/Conv2D_input" = transpose(i"wavenet_2/dilation_layer_4-dilation_rate_1-filter-conv1d/convolution/Conv2D.add_n", axes = [0, 2, 1]);
  i"wavenet_2/dilation_layer_4-dilation_rate_1-filter-conv1d/convolution/Conv2D_conv" = conv(i"wavenet_2/dilation_layer_4-dilation_rate_1-filter-conv1d/convolution/Conv2D_input", i"wavenet_2/dilation_layer_4-dilation_rate_1-filter-conv1d/convolution/Conv2D.kernel_reorg_go", i"wavenet_2/pre_conv-conv1d/convolution/Conv2D.bias", dilation = [1], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"wavenet_2/dilation_layer_4-dilation_rate_1-filter-conv1d/convolution/Conv2D" = transpose(i"wavenet_2/dilation_layer_4-dilation_rate_1-filter-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]);
  i"wavenet_2/dilation_layer_4-dilation_rate_1-filter-conv1d/convolution/Conv2D.rm_n" = squeeze(i"wavenet_2/dilation_layer_4-dilation_rate_1-filter-conv1d/convolution/Conv2D", axes = [0]);
  i"wavenet_2/dilation_layer_4-dilation_rate_1-filter-conv1d/Tanh" = tanh(i"wavenet_2/dilation_layer_4-dilation_rate_1-filter-conv1d/convolution/Conv2D.rm_n");
  i"wavenet_2/dilation_layer_4-dilation_rate_1-gate-conv1d/convolution/Conv2D.add_n" = unsqueeze(i"wavenet_2/dilation_layer_4-dilation_rate_1-filter-conv1d/convolution/Conv2D.delay", axes = [0]);
  i"wavenet_2/dilation_layer_4-dilation_rate_1-gate-conv1d/convolution/Conv2D.kernel_reorg_go" = variable<scalar>(label = "wavenet_2/dilation_layer_4-dilation_rate_1-gate-conv1d/convolution/Conv2D.kernel_reorg_go", shape = [64, 16, 3]);
  i"wavenet_2/dilation_layer_4-dilation_rate_1-gate-conv1d/convolution/Conv2D_input" = transpose(i"wavenet_2/dilation_layer_4-dilation_rate_1-gate-conv1d/convolution/Conv2D.add_n", axes = [0, 2, 1]);
  i"wavenet_2/dilation_layer_4-dilation_rate_1-gate-conv1d/convolution/Conv2D_conv" = conv(i"wavenet_2/dilation_layer_4-dilation_rate_1-gate-conv1d/convolution/Conv2D_input", i"wavenet_2/dilation_layer_4-dilation_rate_1-gate-conv1d/convolution/Conv2D.kernel_reorg_go", i"wavenet_2/pre_conv-conv1d/convolution/Conv2D.bias", dilation = [1], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"wavenet_2/dilation_layer_4-dilation_rate_1-gate-conv1d/convolution/Conv2D" = transpose(i"wavenet_2/dilation_layer_4-dilation_rate_1-gate-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]);
  i"wavenet_2/dilation_layer_4-dilation_rate_1-gate-conv1d/convolution/Conv2D.rm_n" = squeeze(i"wavenet_2/dilation_layer_4-dilation_rate_1-gate-conv1d/convolution/Conv2D", axes = [0]);
  i"wavenet_2/dilation_layer_4-dilation_rate_1-gate-conv1d/Sigmoid" = sigmoid(i"wavenet_2/dilation_layer_4-dilation_rate_1-gate-conv1d/convolution/Conv2D.rm_n");
  i"wavenet_2/mul_4" = mul(i"wavenet_2/dilation_layer_4-dilation_rate_1-filter-conv1d/Tanh", i"wavenet_2/dilation_layer_4-dilation_rate_1-gate-conv1d/Sigmoid");
  i"wavenet_2/dilation_layer_4-dilation_rate_1-1x1_conv_skip-conv1d/convolution/Conv2D.filters_as_co_ci" = variable<scalar>(label = "wavenet_2/dilation_layer_4-dilation_rate_1-1x1_conv_skip-conv1d/convolution/Conv2D.filters_as_co_ci", shape = [32, 64]);
  i"wavenet_2/dilation_layer_4-dilation_rate_1-1x1_conv_skip-conv1d/convolution/Conv2D.split-over-2.148..S+-34" = matmul(i"wavenet_2/mul_4", i"wavenet_2/dilation_layer_4-dilation_rate_1-1x1_conv_skip-conv1d/convolution/Conv2D.filters_as_co_ci", transposeA = false, transposeB = true);
  i"wavenet_2/AddN.3" = add(i"wavenet_2/AddN.2", i"wavenet_2/dilation_layer_4-dilation_rate_1-1x1_conv_skip-conv1d/convolution/Conv2D.split-over-2.148..S+-34");
  i"wavenet_2/dilation_layer_4-dilation_rate_1-1x1_conv_transform-conv1d/convolution/Conv2D.filters_as_co_ci" = variable<scalar>(label = "wavenet_2/dilation_layer_4-dilation_rate_1-1x1_conv_transform-conv1d/convolution/Conv2D.filters_as_co_ci", shape = [16, 64]);
  i"wavenet_2/dilation_layer_4-dilation_rate_1-1x1_conv_transform-conv1d/convolution/Conv2D" = matmul(i"wavenet_2/mul_4", i"wavenet_2/dilation_layer_4-dilation_rate_1-1x1_conv_transform-conv1d/convolution/Conv2D.filters_as_co_ci", transposeA = false, transposeB = true);
  i"wavenet_2/add_4" = add(i"wavenet_2/dilation_layer_4-dilation_rate_1-1x1_conv_transform-conv1d/convolution/Conv2D", i"wavenet_2/add_3");
  i"wavenet_2/dilation_layer_5-dilation_rate_2-filter-conv1d/convolution/Conv2D.delay" = tract_pulse_delay(i"wavenet_2/add_4", axis = 0, delay = 0, overlap = 4);
  i"wavenet_2/dilation_layer_5-dilation_rate_2-filter-conv1d/convolution/Conv2D.add_n" = unsqueeze(i"wavenet_2/dilation_layer_5-dilation_rate_2-filter-conv1d/convolution/Conv2D.delay", axes = [0]);
  i"wavenet_2/dilation_layer_5-dilation_rate_2-filter-conv1d/convolution/Conv2D.kernel_reorg_go" = variable<scalar>(label = "wavenet_2/dilation_layer_5-dilation_rate_2-filter-conv1d/convolution/Conv2D.kernel_reorg_go", shape = [64, 16, 3]);
  i"wavenet_2/dilation_layer_5-dilation_rate_2-filter-conv1d/convolution/Conv2D_input" = transpose(i"wavenet_2/dilation_layer_5-dilation_rate_2-filter-conv1d/convolution/Conv2D.add_n", axes = [0, 2, 1]);
  i"wavenet_2/dilation_layer_5-dilation_rate_2-filter-conv1d/convolution/Conv2D_conv" = conv(i"wavenet_2/dilation_layer_5-dilation_rate_2-filter-conv1d/convolution/Conv2D_input", i"wavenet_2/dilation_layer_5-dilation_rate_2-filter-conv1d/convolution/Conv2D.kernel_reorg_go", i"wavenet_2/pre_conv-conv1d/convolution/Conv2D.bias", dilation = [2], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"wavenet_2/dilation_layer_5-dilation_rate_2-filter-conv1d/convolution/Conv2D" = transpose(i"wavenet_2/dilation_layer_5-dilation_rate_2-filter-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]);
  i"wavenet_2/dilation_layer_5-dilation_rate_2-filter-conv1d/convolution/Conv2D.rm_n" = squeeze(i"wavenet_2/dilation_layer_5-dilation_rate_2-filter-conv1d/convolution/Conv2D", axes = [0]);
  i"wavenet_2/dilation_layer_5-dilation_rate_2-filter-conv1d/Tanh" = tanh(i"wavenet_2/dilation_layer_5-dilation_rate_2-filter-conv1d/convolution/Conv2D.rm_n");
  i"wavenet_2/dilation_layer_5-dilation_rate_2-gate-conv1d/convolution/Conv2D.add_n" = unsqueeze(i"wavenet_2/dilation_layer_5-dilation_rate_2-filter-conv1d/convolution/Conv2D.delay", axes = [0]);
  i"wavenet_2/dilation_layer_5-dilation_rate_2-gate-conv1d/convolution/Conv2D.kernel_reorg_go" = variable<scalar>(label = "wavenet_2/dilation_layer_5-dilation_rate_2-gate-conv1d/convolution/Conv2D.kernel_reorg_go", shape = [64, 16, 3]);
  i"wavenet_2/dilation_layer_5-dilation_rate_2-gate-conv1d/convolution/Conv2D_input" = transpose(i"wavenet_2/dilation_layer_5-dilation_rate_2-gate-conv1d/convolution/Conv2D.add_n", axes = [0, 2, 1]);
  i"wavenet_2/dilation_layer_5-dilation_rate_2-gate-conv1d/convolution/Conv2D_conv" = conv(i"wavenet_2/dilation_layer_5-dilation_rate_2-gate-conv1d/convolution/Conv2D_input", i"wavenet_2/dilation_layer_5-dilation_rate_2-gate-conv1d/convolution/Conv2D.kernel_reorg_go", i"wavenet_2/pre_conv-conv1d/convolution/Conv2D.bias", dilation = [2], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"wavenet_2/dilation_layer_5-dilation_rate_2-gate-conv1d/convolution/Conv2D" = transpose(i"wavenet_2/dilation_layer_5-dilation_rate_2-gate-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]);
  i"wavenet_2/dilation_layer_5-dilation_rate_2-gate-conv1d/convolution/Conv2D.rm_n" = squeeze(i"wavenet_2/dilation_layer_5-dilation_rate_2-gate-conv1d/convolution/Conv2D", axes = [0]);
  i"wavenet_2/dilation_layer_5-dilation_rate_2-gate-conv1d/Sigmoid" = sigmoid(i"wavenet_2/dilation_layer_5-dilation_rate_2-gate-conv1d/convolution/Conv2D.rm_n");
  i"wavenet_2/mul_5" = mul(i"wavenet_2/dilation_layer_5-dilation_rate_2-filter-conv1d/Tanh", i"wavenet_2/dilation_layer_5-dilation_rate_2-gate-conv1d/Sigmoid");
  i"wavenet_2/dilation_layer_5-dilation_rate_2-1x1_conv_skip-conv1d/convolution/Conv2D.filters_as_co_ci" = variable<scalar>(label = "wavenet_2/dilation_layer_5-dilation_rate_2-1x1_conv_skip-conv1d/convolution/Conv2D.filters_as_co_ci", shape = [32, 64]);
  i"wavenet_2/dilation_layer_5-dilation_rate_2-1x1_conv_skip-conv1d/convolution/Conv2D.split-over-2.144..S+-38" = matmul(i"wavenet_2/mul_5", i"wavenet_2/dilation_layer_5-dilation_rate_2-1x1_conv_skip-conv1d/convolution/Conv2D.filters_as_co_ci", transposeA = false, transposeB = true);
  i"wavenet_2/AddN.4" = add(i"wavenet_2/AddN.3", i"wavenet_2/dilation_layer_5-dilation_rate_2-1x1_conv_skip-conv1d/convolution/Conv2D.split-over-2.144..S+-38");
  i"wavenet_2/dilation_layer_5-dilation_rate_2-1x1_conv_transform-conv1d/convolution/Conv2D.filters_as_co_ci" = variable<scalar>(label = "wavenet_2/dilation_layer_5-dilation_rate_2-1x1_conv_transform-conv1d/convolution/Conv2D.filters_as_co_ci", shape = [16, 64]);
  i"wavenet_2/dilation_layer_5-dilation_rate_2-1x1_conv_transform-conv1d/convolution/Conv2D" = matmul(i"wavenet_2/mul_5", i"wavenet_2/dilation_layer_5-dilation_rate_2-1x1_conv_transform-conv1d/convolution/Conv2D.filters_as_co_ci", transposeA = false, transposeB = true);
  i"wavenet_2/add_5" = add(i"wavenet_2/dilation_layer_5-dilation_rate_2-1x1_conv_transform-conv1d/convolution/Conv2D", i"wavenet_2/add_4");
  i"wavenet_2/dilation_layer_6-dilation_rate_4-filter-conv1d/convolution/Conv2D.delay" = tract_pulse_delay(i"wavenet_2/add_5", axis = 0, delay = 0, overlap = 8);
  i"wavenet_2/dilation_layer_6-dilation_rate_4-filter-conv1d/convolution/Conv2D.add_n" = unsqueeze(i"wavenet_2/dilation_layer_6-dilation_rate_4-filter-conv1d/convolution/Conv2D.delay", axes = [0]);
  i"wavenet_2/dilation_layer_6-dilation_rate_4-filter-conv1d/convolution/Conv2D.kernel_reorg_go" = variable<scalar>(label = "wavenet_2/dilation_layer_6-dilation_rate_4-filter-conv1d/convolution/Conv2D.kernel_reorg_go", shape = [64, 16, 3]);
  i"wavenet_2/dilation_layer_6-dilation_rate_4-filter-conv1d/convolution/Conv2D_input" = transpose(i"wavenet_2/dilation_layer_6-dilation_rate_4-filter-conv1d/convolution/Conv2D.add_n", axes = [0, 2, 1]);
  i"wavenet_2/dilation_layer_6-dilation_rate_4-filter-conv1d/convolution/Conv2D_conv" = conv(i"wavenet_2/dilation_layer_6-dilation_rate_4-filter-conv1d/convolution/Conv2D_input", i"wavenet_2/dilation_layer_6-dilation_rate_4-filter-conv1d/convolution/Conv2D.kernel_reorg_go", i"wavenet_2/pre_conv-conv1d/convolution/Conv2D.bias", dilation = [4], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"wavenet_2/dilation_layer_6-dilation_rate_4-filter-conv1d/convolution/Conv2D" = transpose(i"wavenet_2/dilation_layer_6-dilation_rate_4-filter-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]);
  i"wavenet_2/dilation_layer_6-dilation_rate_4-filter-conv1d/convolution/Conv2D.rm_n" = squeeze(i"wavenet_2/dilation_layer_6-dilation_rate_4-filter-conv1d/convolution/Conv2D", axes = [0]);
  i"wavenet_2/dilation_layer_6-dilation_rate_4-filter-conv1d/Tanh" = tanh(i"wavenet_2/dilation_layer_6-dilation_rate_4-filter-conv1d/convolution/Conv2D.rm_n");
  i"wavenet_2/dilation_layer_6-dilation_rate_4-gate-conv1d/convolution/Conv2D.add_n" = unsqueeze(i"wavenet_2/dilation_layer_6-dilation_rate_4-filter-conv1d/convolution/Conv2D.delay", axes = [0]);
  i"wavenet_2/dilation_layer_6-dilation_rate_4-gate-conv1d/convolution/Conv2D.kernel_reorg_go" = variable<scalar>(label = "wavenet_2/dilation_layer_6-dilation_rate_4-gate-conv1d/convolution/Conv2D.kernel_reorg_go", shape = [64, 16, 3]);
  i"wavenet_2/dilation_layer_6-dilation_rate_4-gate-conv1d/convolution/Conv2D_input" = transpose(i"wavenet_2/dilation_layer_6-dilation_rate_4-gate-conv1d/convolution/Conv2D.add_n", axes = [0, 2, 1]);
  i"wavenet_2/dilation_layer_6-dilation_rate_4-gate-conv1d/convolution/Conv2D_conv" = conv(i"wavenet_2/dilation_layer_6-dilation_rate_4-gate-conv1d/convolution/Conv2D_input", i"wavenet_2/dilation_layer_6-dilation_rate_4-gate-conv1d/convolution/Conv2D.kernel_reorg_go", i"wavenet_2/pre_conv-conv1d/convolution/Conv2D.bias", dilation = [4], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"wavenet_2/dilation_layer_6-dilation_rate_4-gate-conv1d/convolution/Conv2D" = transpose(i"wavenet_2/dilation_layer_6-dilation_rate_4-gate-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]);
  i"wavenet_2/dilation_layer_6-dilation_rate_4-gate-conv1d/convolution/Conv2D.rm_n" = squeeze(i"wavenet_2/dilation_layer_6-dilation_rate_4-gate-conv1d/convolution/Conv2D", axes = [0]);
  i"wavenet_2/dilation_layer_6-dilation_rate_4-gate-conv1d/Sigmoid" = sigmoid(i"wavenet_2/dilation_layer_6-dilation_rate_4-gate-conv1d/convolution/Conv2D.rm_n");
  i"wavenet_2/mul_6" = mul(i"wavenet_2/dilation_layer_6-dilation_rate_4-filter-conv1d/Tanh", i"wavenet_2/dilation_layer_6-dilation_rate_4-gate-conv1d/Sigmoid");
  i"wavenet_2/dilation_layer_6-dilation_rate_4-1x1_conv_skip-conv1d/convolution/Conv2D.filters_as_co_ci" = variable<scalar>(label = "wavenet_2/dilation_layer_6-dilation_rate_4-1x1_conv_skip-conv1d/convolution/Conv2D.filters_as_co_ci", shape = [32, 64]);
  i"wavenet_2/dilation_layer_6-dilation_rate_4-1x1_conv_skip-conv1d/convolution/Conv2D.split-over-2.136..S+-46" = matmul(i"wavenet_2/mul_6", i"wavenet_2/dilation_layer_6-dilation_rate_4-1x1_conv_skip-conv1d/convolution/Conv2D.filters_as_co_ci", transposeA = false, transposeB = true);
  i"wavenet_2/AddN.5" = add(i"wavenet_2/AddN.4", i"wavenet_2/dilation_layer_6-dilation_rate_4-1x1_conv_skip-conv1d/convolution/Conv2D.split-over-2.136..S+-46");
  i"wavenet_2/dilation_layer_6-dilation_rate_4-1x1_conv_transform-conv1d/convolution/Conv2D.filters_as_co_ci" = variable<scalar>(label = "wavenet_2/dilation_layer_6-dilation_rate_4-1x1_conv_transform-conv1d/convolution/Conv2D.filters_as_co_ci", shape = [16, 64]);
  i"wavenet_2/dilation_layer_6-dilation_rate_4-1x1_conv_transform-conv1d/convolution/Conv2D" = matmul(i"wavenet_2/mul_6", i"wavenet_2/dilation_layer_6-dilation_rate_4-1x1_conv_transform-conv1d/convolution/Conv2D.filters_as_co_ci", transposeA = false, transposeB = true);
  i"wavenet_2/add_6" = add(i"wavenet_2/dilation_layer_6-dilation_rate_4-1x1_conv_transform-conv1d/convolution/Conv2D", i"wavenet_2/add_5");
  i"wavenet_2/dilation_layer_7-dilation_rate_8-filter-conv1d/convolution/Conv2D.delay" = tract_pulse_delay(i"wavenet_2/add_6", axis = 0, delay = 0, overlap = 16);
  i"wavenet_2/dilation_layer_7-dilation_rate_8-filter-conv1d/convolution/Conv2D.add_n" = unsqueeze(i"wavenet_2/dilation_layer_7-dilation_rate_8-filter-conv1d/convolution/Conv2D.delay", axes = [0]);
  i"wavenet_2/dilation_layer_7-dilation_rate_8-filter-conv1d/convolution/Conv2D.kernel_reorg_go" = variable<scalar>(label = "wavenet_2/dilation_layer_7-dilation_rate_8-filter-conv1d/convolution/Conv2D.kernel_reorg_go", shape = [64, 16, 3]);
  i"wavenet_2/dilation_layer_7-dilation_rate_8-filter-conv1d/convolution/Conv2D_input" = transpose(i"wavenet_2/dilation_layer_7-dilation_rate_8-filter-conv1d/convolution/Conv2D.add_n", axes = [0, 2, 1]);
  i"wavenet_2/dilation_layer_7-dilation_rate_8-filter-conv1d/convolution/Conv2D_conv" = conv(i"wavenet_2/dilation_layer_7-dilation_rate_8-filter-conv1d/convolution/Conv2D_input", i"wavenet_2/dilation_layer_7-dilation_rate_8-filter-conv1d/convolution/Conv2D.kernel_reorg_go", i"wavenet_2/pre_conv-conv1d/convolution/Conv2D.bias", dilation = [8], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"wavenet_2/dilation_layer_7-dilation_rate_8-filter-conv1d/convolution/Conv2D" = transpose(i"wavenet_2/dilation_layer_7-dilation_rate_8-filter-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]);
  i"wavenet_2/dilation_layer_7-dilation_rate_8-filter-conv1d/convolution/Conv2D.rm_n" = squeeze(i"wavenet_2/dilation_layer_7-dilation_rate_8-filter-conv1d/convolution/Conv2D", axes = [0]);
  i"wavenet_2/dilation_layer_7-dilation_rate_8-filter-conv1d/Tanh" = tanh(i"wavenet_2/dilation_layer_7-dilation_rate_8-filter-conv1d/convolution/Conv2D.rm_n");
  i"wavenet_2/dilation_layer_7-dilation_rate_8-gate-conv1d/convolution/Conv2D.add_n" = unsqueeze(i"wavenet_2/dilation_layer_7-dilation_rate_8-filter-conv1d/convolution/Conv2D.delay", axes = [0]);
  i"wavenet_2/dilation_layer_7-dilation_rate_8-gate-conv1d/convolution/Conv2D.kernel_reorg_go" = variable<scalar>(label = "wavenet_2/dilation_layer_7-dilation_rate_8-gate-conv1d/convolution/Conv2D.kernel_reorg_go", shape = [64, 16, 3]);
  i"wavenet_2/dilation_layer_7-dilation_rate_8-gate-conv1d/convolution/Conv2D_input" = transpose(i"wavenet_2/dilation_layer_7-dilation_rate_8-gate-conv1d/convolution/Conv2D.add_n", axes = [0, 2, 1]);
  i"wavenet_2/dilation_layer_7-dilation_rate_8-gate-conv1d/convolution/Conv2D_conv" = conv(i"wavenet_2/dilation_layer_7-dilation_rate_8-gate-conv1d/convolution/Conv2D_input", i"wavenet_2/dilation_layer_7-dilation_rate_8-gate-conv1d/convolution/Conv2D.kernel_reorg_go", i"wavenet_2/pre_conv-conv1d/convolution/Conv2D.bias", dilation = [8], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"wavenet_2/dilation_layer_7-dilation_rate_8-gate-conv1d/convolution/Conv2D" = transpose(i"wavenet_2/dilation_layer_7-dilation_rate_8-gate-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]);
  i"wavenet_2/dilation_layer_7-dilation_rate_8-gate-conv1d/convolution/Conv2D.rm_n" = squeeze(i"wavenet_2/dilation_layer_7-dilation_rate_8-gate-conv1d/convolution/Conv2D", axes = [0]);
  i"wavenet_2/dilation_layer_7-dilation_rate_8-gate-conv1d/Sigmoid" = sigmoid(i"wavenet_2/dilation_layer_7-dilation_rate_8-gate-conv1d/convolution/Conv2D.rm_n");
  i"wavenet_2/mul_7" = mul(i"wavenet_2/dilation_layer_7-dilation_rate_8-filter-conv1d/Tanh", i"wavenet_2/dilation_layer_7-dilation_rate_8-gate-conv1d/Sigmoid");
  i"wavenet_2/dilation_layer_7-dilation_rate_8-1x1_conv_skip-conv1d/convolution/Conv2D.filters_as_co_ci" = variable<scalar>(label = "wavenet_2/dilation_layer_7-dilation_rate_8-1x1_conv_skip-conv1d/convolution/Conv2D.filters_as_co_ci", shape = [32, 64]);
  i"wavenet_2/dilation_layer_7-dilation_rate_8-1x1_conv_skip-conv1d/convolution/Conv2D.split-over-2.120..S+-62" = matmul(i"wavenet_2/mul_7", i"wavenet_2/dilation_layer_7-dilation_rate_8-1x1_conv_skip-conv1d/convolution/Conv2D.filters_as_co_ci", transposeA = false, transposeB = true);
  i"wavenet_2/AddN.6" = add(i"wavenet_2/AddN.5", i"wavenet_2/dilation_layer_7-dilation_rate_8-1x1_conv_skip-conv1d/convolution/Conv2D.split-over-2.120..S+-62");
  i"wavenet_2/dilation_layer_7-dilation_rate_8-1x1_conv_transform-conv1d/convolution/Conv2D.filters_as_co_ci" = variable<scalar>(label = "wavenet_2/dilation_layer_7-dilation_rate_8-1x1_conv_transform-conv1d/convolution/Conv2D.filters_as_co_ci", shape = [16, 64]);
  i"wavenet_2/dilation_layer_7-dilation_rate_8-1x1_conv_transform-conv1d/convolution/Conv2D" = matmul(i"wavenet_2/mul_7", i"wavenet_2/dilation_layer_7-dilation_rate_8-1x1_conv_transform-conv1d/convolution/Conv2D.filters_as_co_ci", transposeA = false, transposeB = true);
  i"wavenet_2/add_7" = add(i"wavenet_2/dilation_layer_7-dilation_rate_8-1x1_conv_transform-conv1d/convolution/Conv2D", i"wavenet_2/add_6");
  i"wavenet_2/dilation_layer_8-dilation_rate_1-filter-conv1d/convolution/Conv2D.delay" = tract_pulse_delay(i"wavenet_2/add_7", axis = 0, delay = 0, overlap = 2);
  i"wavenet_2/dilation_layer_8-dilation_rate_1-filter-conv1d/convolution/Conv2D.add_n" = unsqueeze(i"wavenet_2/dilation_layer_8-dilation_rate_1-filter-conv1d/convolution/Conv2D.delay", axes = [0]);
  i"wavenet_2/dilation_layer_8-dilation_rate_1-filter-conv1d/convolution/Conv2D.kernel_reorg_go" = variable<scalar>(label = "wavenet_2/dilation_layer_8-dilation_rate_1-filter-conv1d/convolution/Conv2D.kernel_reorg_go", shape = [64, 16, 3]);
  i"wavenet_2/dilation_layer_8-dilation_rate_1-filter-conv1d/convolution/Conv2D_input" = transpose(i"wavenet_2/dilation_layer_8-dilation_rate_1-filter-conv1d/convolution/Conv2D.add_n", axes = [0, 2, 1]);
  i"wavenet_2/dilation_layer_8-dilation_rate_1-filter-conv1d/convolution/Conv2D_conv" = conv(i"wavenet_2/dilation_layer_8-dilation_rate_1-filter-conv1d/convolution/Conv2D_input", i"wavenet_2/dilation_layer_8-dilation_rate_1-filter-conv1d/convolution/Conv2D.kernel_reorg_go", i"wavenet_2/pre_conv-conv1d/convolution/Conv2D.bias", dilation = [1], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"wavenet_2/dilation_layer_8-dilation_rate_1-filter-conv1d/convolution/Conv2D" = transpose(i"wavenet_2/dilation_layer_8-dilation_rate_1-filter-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]);
  i"wavenet_2/dilation_layer_8-dilation_rate_1-filter-conv1d/convolution/Conv2D.rm_n" = squeeze(i"wavenet_2/dilation_layer_8-dilation_rate_1-filter-conv1d/convolution/Conv2D", axes = [0]);
  i"wavenet_2/dilation_layer_8-dilation_rate_1-filter-conv1d/Tanh" = tanh(i"wavenet_2/dilation_layer_8-dilation_rate_1-filter-conv1d/convolution/Conv2D.rm_n");
  i"wavenet_2/dilation_layer_8-dilation_rate_1-gate-conv1d/convolution/Conv2D.add_n" = unsqueeze(i"wavenet_2/dilation_layer_8-dilation_rate_1-filter-conv1d/convolution/Conv2D.delay", axes = [0]);
  i"wavenet_2/dilation_layer_8-dilation_rate_1-gate-conv1d/convolution/Conv2D.kernel_reorg_go" = variable<scalar>(label = "wavenet_2/dilation_layer_8-dilation_rate_1-gate-conv1d/convolution/Conv2D.kernel_reorg_go", shape = [64, 16, 3]);
  i"wavenet_2/dilation_layer_8-dilation_rate_1-gate-conv1d/convolution/Conv2D_input" = transpose(i"wavenet_2/dilation_layer_8-dilation_rate_1-gate-conv1d/convolution/Conv2D.add_n", axes = [0, 2, 1]);
  i"wavenet_2/dilation_layer_8-dilation_rate_1-gate-conv1d/convolution/Conv2D_conv" = conv(i"wavenet_2/dilation_layer_8-dilation_rate_1-gate-conv1d/convolution/Conv2D_input", i"wavenet_2/dilation_layer_8-dilation_rate_1-gate-conv1d/convolution/Conv2D.kernel_reorg_go", i"wavenet_2/pre_conv-conv1d/convolution/Conv2D.bias", dilation = [1], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"wavenet_2/dilation_layer_8-dilation_rate_1-gate-conv1d/convolution/Conv2D" = transpose(i"wavenet_2/dilation_layer_8-dilation_rate_1-gate-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]);
  i"wavenet_2/dilation_layer_8-dilation_rate_1-gate-conv1d/convolution/Conv2D.rm_n" = squeeze(i"wavenet_2/dilation_layer_8-dilation_rate_1-gate-conv1d/convolution/Conv2D", axes = [0]);
  i"wavenet_2/dilation_layer_8-dilation_rate_1-gate-conv1d/Sigmoid" = sigmoid(i"wavenet_2/dilation_layer_8-dilation_rate_1-gate-conv1d/convolution/Conv2D.rm_n");
  i"wavenet_2/mul_8" = mul(i"wavenet_2/dilation_layer_8-dilation_rate_1-filter-conv1d/Tanh", i"wavenet_2/dilation_layer_8-dilation_rate_1-gate-conv1d/Sigmoid");
  i"wavenet_2/dilation_layer_8-dilation_rate_1-1x1_conv_skip-conv1d/convolution/Conv2D.filters_as_co_ci" = variable<scalar>(label = "wavenet_2/dilation_layer_8-dilation_rate_1-1x1_conv_skip-conv1d/convolution/Conv2D.filters_as_co_ci", shape = [32, 64]);
  i"wavenet_2/dilation_layer_8-dilation_rate_1-1x1_conv_skip-conv1d/convolution/Conv2D.split-over-2.118..S+-64" = matmul(i"wavenet_2/mul_8", i"wavenet_2/dilation_layer_8-dilation_rate_1-1x1_conv_skip-conv1d/convolution/Conv2D.filters_as_co_ci", transposeA = false, transposeB = true);
  i"wavenet_2/AddN.7" = add(i"wavenet_2/AddN.6", i"wavenet_2/dilation_layer_8-dilation_rate_1-1x1_conv_skip-conv1d/convolution/Conv2D.split-over-2.118..S+-64");
  i"wavenet_2/dilation_layer_8-dilation_rate_1-1x1_conv_transform-conv1d/convolution/Conv2D.filters_as_co_ci" = variable<scalar>(label = "wavenet_2/dilation_layer_8-dilation_rate_1-1x1_conv_transform-conv1d/convolution/Conv2D.filters_as_co_ci", shape = [16, 64]);
  i"wavenet_2/dilation_layer_8-dilation_rate_1-1x1_conv_transform-conv1d/convolution/Conv2D" = matmul(i"wavenet_2/mul_8", i"wavenet_2/dilation_layer_8-dilation_rate_1-1x1_conv_transform-conv1d/convolution/Conv2D.filters_as_co_ci", transposeA = false, transposeB = true);
  i"wavenet_2/add_8" = add(i"wavenet_2/dilation_layer_8-dilation_rate_1-1x1_conv_transform-conv1d/convolution/Conv2D", i"wavenet_2/add_7");
  i"wavenet_2/dilation_layer_9-dilation_rate_2-filter-conv1d/convolution/Conv2D.delay" = tract_pulse_delay(i"wavenet_2/add_8", axis = 0, delay = 0, overlap = 4);
  i"wavenet_2/dilation_layer_9-dilation_rate_2-filter-conv1d/convolution/Conv2D.add_n" = unsqueeze(i"wavenet_2/dilation_layer_9-dilation_rate_2-filter-conv1d/convolution/Conv2D.delay", axes = [0]);
  i"wavenet_2/dilation_layer_9-dilation_rate_2-filter-conv1d/convolution/Conv2D.kernel_reorg_go" = variable<scalar>(label = "wavenet_2/dilation_layer_9-dilation_rate_2-filter-conv1d/convolution/Conv2D.kernel_reorg_go", shape = [64, 16, 3]);
  i"wavenet_2/dilation_layer_9-dilation_rate_2-filter-conv1d/convolution/Conv2D_input" = transpose(i"wavenet_2/dilation_layer_9-dilation_rate_2-filter-conv1d/convolution/Conv2D.add_n", axes = [0, 2, 1]);
  i"wavenet_2/dilation_layer_9-dilation_rate_2-filter-conv1d/convolution/Conv2D_conv" = conv(i"wavenet_2/dilation_layer_9-dilation_rate_2-filter-conv1d/convolution/Conv2D_input", i"wavenet_2/dilation_layer_9-dilation_rate_2-filter-conv1d/convolution/Conv2D.kernel_reorg_go", i"wavenet_2/pre_conv-conv1d/convolution/Conv2D.bias", dilation = [2], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"wavenet_2/dilation_layer_9-dilation_rate_2-filter-conv1d/convolution/Conv2D" = transpose(i"wavenet_2/dilation_layer_9-dilation_rate_2-filter-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]);
  i"wavenet_2/dilation_layer_9-dilation_rate_2-filter-conv1d/convolution/Conv2D.rm_n" = squeeze(i"wavenet_2/dilation_layer_9-dilation_rate_2-filter-conv1d/convolution/Conv2D", axes = [0]);
  i"wavenet_2/dilation_layer_9-dilation_rate_2-filter-conv1d/Tanh" = tanh(i"wavenet_2/dilation_layer_9-dilation_rate_2-filter-conv1d/convolution/Conv2D.rm_n");
  i"wavenet_2/dilation_layer_9-dilation_rate_2-gate-conv1d/convolution/Conv2D.add_n" = unsqueeze(i"wavenet_2/dilation_layer_9-dilation_rate_2-filter-conv1d/convolution/Conv2D.delay", axes = [0]);
  i"wavenet_2/dilation_layer_9-dilation_rate_2-gate-conv1d/convolution/Conv2D.kernel_reorg_go" = variable<scalar>(label = "wavenet_2/dilation_layer_9-dilation_rate_2-gate-conv1d/convolution/Conv2D.kernel_reorg_go", shape = [64, 16, 3]);
  i"wavenet_2/dilation_layer_9-dilation_rate_2-gate-conv1d/convolution/Conv2D_input" = transpose(i"wavenet_2/dilation_layer_9-dilation_rate_2-gate-conv1d/convolution/Conv2D.add_n", axes = [0, 2, 1]);
  i"wavenet_2/dilation_layer_9-dilation_rate_2-gate-conv1d/convolution/Conv2D_conv" = conv(i"wavenet_2/dilation_layer_9-dilation_rate_2-gate-conv1d/convolution/Conv2D_input", i"wavenet_2/dilation_layer_9-dilation_rate_2-gate-conv1d/convolution/Conv2D.kernel_reorg_go", i"wavenet_2/pre_conv-conv1d/convolution/Conv2D.bias", dilation = [2], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"wavenet_2/dilation_layer_9-dilation_rate_2-gate-conv1d/convolution/Conv2D" = transpose(i"wavenet_2/dilation_layer_9-dilation_rate_2-gate-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]);
  i"wavenet_2/dilation_layer_9-dilation_rate_2-gate-conv1d/convolution/Conv2D.rm_n" = squeeze(i"wavenet_2/dilation_layer_9-dilation_rate_2-gate-conv1d/convolution/Conv2D", axes = [0]);
  i"wavenet_2/dilation_layer_9-dilation_rate_2-gate-conv1d/Sigmoid" = sigmoid(i"wavenet_2/dilation_layer_9-dilation_rate_2-gate-conv1d/convolution/Conv2D.rm_n");
  i"wavenet_2/mul_9" = mul(i"wavenet_2/dilation_layer_9-dilation_rate_2-filter-conv1d/Tanh", i"wavenet_2/dilation_layer_9-dilation_rate_2-gate-conv1d/Sigmoid");
