version 1.0;

extension tract_registry tract_core;
extension tract_registry tract_pulse;

fragment tract_core_properties(
) -> (properties: (string, tensor<scalar>)[])
{
  properties = [("pulse.delay", tract_core_cast(182, to = "i64")), ("pulse.input_axes", tract_core_cast(0, to = "i64")), ("pulse.output_axes", tract_core_cast(0, to = "i64")), ("tract_nnef_ser_version", "0.16.10-pre"), ("tract_nnef_format_version", "beta1")];
}

graph wavenet_2( input_node ) -> ( i"post_proc_2-1x1_conv-conv1d/convolution/Conv2D.matmul" ) {
  input_node = external(shape = [8, 20]);
  i"input_batch_normalisation/batchnorm/mul.fix-rank-1-2" = variable<scalar>(label = "wavenet_2/input_batch_normalisation/batchnorm/mul.fix-rank-1-2", shape = [1, 20]);
  i"input_batch_normalisation/batchnorm/mul" = mul(input_node, i"input_batch_normalisation/batchnorm/mul.fix-rank-1-2");
  i"input_batch_normalisation/batchnorm/add_1.fix-rank-1-2" = variable<scalar>(label = "wavenet_2/input_batch_normalisation/batchnorm/add_1.fix-rank-1-2", shape = [1, 20]);
  i"input_batch_normalisation/batchnorm/add_1" = add(i"input_batch_normalisation/batchnorm/mul", i"input_batch_normalisation/batchnorm/add_1.fix-rank-1-2");
  i"pre_conv-conv1d/convolution/Conv2D.delay" = tract_pulse_delay(i"input_batch_normalisation/batchnorm/add_1", axis = 0, delay = 0, overlap = 2);
  i"pre_conv-conv1d/convolution/Conv2D_input" = transpose(unsqueeze(i"pre_conv-conv1d/convolution/Conv2D.delay", axes = [0]), axes = [0, 2, 1]);
  i"pre_conv-conv1d/convolution/Conv2D_weigths" = variable<scalar>(label = "wavenet_2/pre_conv-conv1d/convolution/Conv2D_weigths", shape = [16, 20, 3]);
  i"pre_conv-conv1d/convolution/Conv2D_conv" = conv(i"pre_conv-conv1d/convolution/Conv2D_input", i"pre_conv-conv1d/convolution/Conv2D_weigths", dilation = [1], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"pre_conv-conv1d/convolution/Conv2D" = squeeze(transpose(i"pre_conv-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]), axes = [0]);
  i"dilation_layer_0-dilation_rate_1-filter-conv1d/convolution/Conv2D.delay" = tract_pulse_delay(i"pre_conv-conv1d/convolution/Conv2D", axis = 0, delay = 0, overlap = 2);
  i"dilation_layer_0-dilation_rate_1-filter-conv1d/convolution/Conv2D_input" = transpose(unsqueeze(i"dilation_layer_0-dilation_rate_1-filter-conv1d/convolution/Conv2D.delay", axes = [0]), axes = [0, 2, 1]);
  i"dilation_layer_0-dilation_rate_1-filter-conv1d/convolution/Conv2D_weigths" = variable<scalar>(label = "wavenet_2/dilation_layer_0-dilation_rate_1-filter-conv1d/convolution/Conv2D_weigths", shape = [64, 16, 3]);
  i"dilation_layer_0-dilation_rate_1-filter-conv1d/convolution/Conv2D_conv" = conv(i"dilation_layer_0-dilation_rate_1-filter-conv1d/convolution/Conv2D_input", i"dilation_layer_0-dilation_rate_1-filter-conv1d/convolution/Conv2D_weigths", dilation = [1], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"dilation_layer_0-dilation_rate_1-filter-conv1d/convolution/Conv2D" = squeeze(transpose(i"dilation_layer_0-dilation_rate_1-filter-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]), axes = [0]);
  i"dilation_layer_0-dilation_rate_1-filter-conv1d/Tanh" = tanh(i"dilation_layer_0-dilation_rate_1-filter-conv1d/convolution/Conv2D");
  i"dilation_layer_0-dilation_rate_1-gate-conv1d/convolution/Conv2D_input" = transpose(unsqueeze(i"dilation_layer_0-dilation_rate_1-filter-conv1d/convolution/Conv2D.delay", axes = [0]), axes = [0, 2, 1]);
  i"dilation_layer_0-dilation_rate_1-gate-conv1d/convolution/Conv2D_weigths" = variable<scalar>(label = "wavenet_2/dilation_layer_0-dilation_rate_1-gate-conv1d/convolution/Conv2D_weigths", shape = [64, 16, 3]);
  i"dilation_layer_0-dilation_rate_1-gate-conv1d/convolution/Conv2D_conv" = conv(i"dilation_layer_0-dilation_rate_1-gate-conv1d/convolution/Conv2D_input", i"dilation_layer_0-dilation_rate_1-gate-conv1d/convolution/Conv2D_weigths", dilation = [1], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"dilation_layer_0-dilation_rate_1-gate-conv1d/convolution/Conv2D" = squeeze(transpose(i"dilation_layer_0-dilation_rate_1-gate-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]), axes = [0]);
  i"dilation_layer_0-dilation_rate_1-gate-conv1d/Sigmoid" = sigmoid(i"dilation_layer_0-dilation_rate_1-gate-conv1d/convolution/Conv2D");
  mul = mul(i"dilation_layer_0-dilation_rate_1-filter-conv1d/Tanh", i"dilation_layer_0-dilation_rate_1-gate-conv1d/Sigmoid");
  i"dilation_layer_0-dilation_rate_1-1x1_conv_skip-conv1d/convolution/Conv2D.matmul_a" = variable<scalar>(label = "wavenet_2/dilation_layer_0-dilation_rate_1-1x1_conv_skip-conv1d/convolution/Conv2D.matmul_a", shape = [64, 32]);
  i"dilation_layer_0-dilation_rate_1-1x1_conv_skip-conv1d/convolution/Conv2D.matmul" = matmul(mul, i"dilation_layer_0-dilation_rate_1-1x1_conv_skip-conv1d/convolution/Conv2D.matmul_a", transposeA = false, transposeB = false);
  i"dilation_layer_0-dilation_rate_1-1x1_conv_transform-conv1d/convolution/Conv2D.matmul_a" = variable<scalar>(label = "wavenet_2/dilation_layer_0-dilation_rate_1-1x1_conv_transform-conv1d/convolution/Conv2D.matmul_a", shape = [64, 16]);
  i"dilation_layer_0-dilation_rate_1-1x1_conv_transform-conv1d/convolution/Conv2D.matmul" = matmul(mul, i"dilation_layer_0-dilation_rate_1-1x1_conv_transform-conv1d/convolution/Conv2D.matmul_a", transposeA = false, transposeB = false);
  add = add(i"dilation_layer_0-dilation_rate_1-1x1_conv_transform-conv1d/convolution/Conv2D.matmul", i"pre_conv-conv1d/convolution/Conv2D");
  i"dilation_layer_1-dilation_rate_2-filter-conv1d/convolution/Conv2D.delay" = tract_pulse_delay(add, axis = 0, delay = 0, overlap = 4);
  i"dilation_layer_1-dilation_rate_2-filter-conv1d/convolution/Conv2D_input" = transpose(unsqueeze(i"dilation_layer_1-dilation_rate_2-filter-conv1d/convolution/Conv2D.delay", axes = [0]), axes = [0, 2, 1]);
  i"dilation_layer_1-dilation_rate_2-filter-conv1d/convolution/Conv2D_weigths" = variable<scalar>(label = "wavenet_2/dilation_layer_1-dilation_rate_2-filter-conv1d/convolution/Conv2D_weigths", shape = [64, 16, 3]);
  i"dilation_layer_1-dilation_rate_2-filter-conv1d/convolution/Conv2D_conv" = conv(i"dilation_layer_1-dilation_rate_2-filter-conv1d/convolution/Conv2D_input", i"dilation_layer_1-dilation_rate_2-filter-conv1d/convolution/Conv2D_weigths", dilation = [2], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"dilation_layer_1-dilation_rate_2-filter-conv1d/convolution/Conv2D" = squeeze(transpose(i"dilation_layer_1-dilation_rate_2-filter-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]), axes = [0]);
  i"dilation_layer_1-dilation_rate_2-filter-conv1d/Tanh" = tanh(i"dilation_layer_1-dilation_rate_2-filter-conv1d/convolution/Conv2D");
  i"dilation_layer_1-dilation_rate_2-gate-conv1d/convolution/Conv2D_input" = transpose(unsqueeze(i"dilation_layer_1-dilation_rate_2-filter-conv1d/convolution/Conv2D.delay", axes = [0]), axes = [0, 2, 1]);
  i"dilation_layer_1-dilation_rate_2-gate-conv1d/convolution/Conv2D_weigths" = variable<scalar>(label = "wavenet_2/dilation_layer_1-dilation_rate_2-gate-conv1d/convolution/Conv2D_weigths", shape = [64, 16, 3]);
  i"dilation_layer_1-dilation_rate_2-gate-conv1d/convolution/Conv2D_conv" = conv(i"dilation_layer_1-dilation_rate_2-gate-conv1d/convolution/Conv2D_input", i"dilation_layer_1-dilation_rate_2-gate-conv1d/convolution/Conv2D_weigths", dilation = [2], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"dilation_layer_1-dilation_rate_2-gate-conv1d/convolution/Conv2D" = squeeze(transpose(i"dilation_layer_1-dilation_rate_2-gate-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]), axes = [0]);
  i"dilation_layer_1-dilation_rate_2-gate-conv1d/Sigmoid" = sigmoid(i"dilation_layer_1-dilation_rate_2-gate-conv1d/convolution/Conv2D");
  mul_1 = mul(i"dilation_layer_1-dilation_rate_2-filter-conv1d/Tanh", i"dilation_layer_1-dilation_rate_2-gate-conv1d/Sigmoid");
  i"dilation_layer_1-dilation_rate_2-1x1_conv_skip-conv1d/convolution/Conv2D.matmul_a" = variable<scalar>(label = "wavenet_2/dilation_layer_1-dilation_rate_2-1x1_conv_skip-conv1d/convolution/Conv2D.matmul_a", shape = [64, 32]);
  i"dilation_layer_1-dilation_rate_2-1x1_conv_skip-conv1d/convolution/Conv2D.matmul" = matmul(mul_1, i"dilation_layer_1-dilation_rate_2-1x1_conv_skip-conv1d/convolution/Conv2D.matmul_a", transposeA = false, transposeB = false);
  i"AddN.0" = add(i"dilation_layer_0-dilation_rate_1-1x1_conv_skip-conv1d/convolution/Conv2D.matmul", i"dilation_layer_1-dilation_rate_2-1x1_conv_skip-conv1d/convolution/Conv2D.matmul");
  i"dilation_layer_1-dilation_rate_2-1x1_conv_transform-conv1d/convolution/Conv2D.matmul_a" = variable<scalar>(label = "wavenet_2/dilation_layer_1-dilation_rate_2-1x1_conv_transform-conv1d/convolution/Conv2D.matmul_a", shape = [64, 16]);
  i"dilation_layer_1-dilation_rate_2-1x1_conv_transform-conv1d/convolution/Conv2D.matmul" = matmul(mul_1, i"dilation_layer_1-dilation_rate_2-1x1_conv_transform-conv1d/convolution/Conv2D.matmul_a", transposeA = false, transposeB = false);
  add_1 = add(i"dilation_layer_1-dilation_rate_2-1x1_conv_transform-conv1d/convolution/Conv2D.matmul", add);
  i"dilation_layer_2-dilation_rate_4-filter-conv1d/convolution/Conv2D.delay" = tract_pulse_delay(add_1, axis = 0, delay = 0, overlap = 8);
  i"dilation_layer_2-dilation_rate_4-filter-conv1d/convolution/Conv2D_input" = transpose(unsqueeze(i"dilation_layer_2-dilation_rate_4-filter-conv1d/convolution/Conv2D.delay", axes = [0]), axes = [0, 2, 1]);
  i"dilation_layer_2-dilation_rate_4-filter-conv1d/convolution/Conv2D_weigths" = variable<scalar>(label = "wavenet_2/dilation_layer_2-dilation_rate_4-filter-conv1d/convolution/Conv2D_weigths", shape = [64, 16, 3]);
  i"dilation_layer_2-dilation_rate_4-filter-conv1d/convolution/Conv2D_conv" = conv(i"dilation_layer_2-dilation_rate_4-filter-conv1d/convolution/Conv2D_input", i"dilation_layer_2-dilation_rate_4-filter-conv1d/convolution/Conv2D_weigths", dilation = [4], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"dilation_layer_2-dilation_rate_4-filter-conv1d/convolution/Conv2D" = squeeze(transpose(i"dilation_layer_2-dilation_rate_4-filter-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]), axes = [0]);
  i"dilation_layer_2-dilation_rate_4-filter-conv1d/Tanh" = tanh(i"dilation_layer_2-dilation_rate_4-filter-conv1d/convolution/Conv2D");
  i"dilation_layer_2-dilation_rate_4-gate-conv1d/convolution/Conv2D_input" = transpose(unsqueeze(i"dilation_layer_2-dilation_rate_4-filter-conv1d/convolution/Conv2D.delay", axes = [0]), axes = [0, 2, 1]);
  i"dilation_layer_2-dilation_rate_4-gate-conv1d/convolution/Conv2D_weigths" = variable<scalar>(label = "wavenet_2/dilation_layer_2-dilation_rate_4-gate-conv1d/convolution/Conv2D_weigths", shape = [64, 16, 3]);
  i"dilation_layer_2-dilation_rate_4-gate-conv1d/convolution/Conv2D_conv" = conv(i"dilation_layer_2-dilation_rate_4-gate-conv1d/convolution/Conv2D_input", i"dilation_layer_2-dilation_rate_4-gate-conv1d/convolution/Conv2D_weigths", dilation = [4], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"dilation_layer_2-dilation_rate_4-gate-conv1d/convolution/Conv2D" = squeeze(transpose(i"dilation_layer_2-dilation_rate_4-gate-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]), axes = [0]);
  i"dilation_layer_2-dilation_rate_4-gate-conv1d/Sigmoid" = sigmoid(i"dilation_layer_2-dilation_rate_4-gate-conv1d/convolution/Conv2D");
  mul_2 = mul(i"dilation_layer_2-dilation_rate_4-filter-conv1d/Tanh", i"dilation_layer_2-dilation_rate_4-gate-conv1d/Sigmoid");
  i"dilation_layer_2-dilation_rate_4-1x1_conv_skip-conv1d/convolution/Conv2D.matmul_a" = variable<scalar>(label = "wavenet_2/dilation_layer_2-dilation_rate_4-1x1_conv_skip-conv1d/convolution/Conv2D.matmul_a", shape = [64, 32]);
  i"dilation_layer_2-dilation_rate_4-1x1_conv_skip-conv1d/convolution/Conv2D.matmul" = matmul(mul_2, i"dilation_layer_2-dilation_rate_4-1x1_conv_skip-conv1d/convolution/Conv2D.matmul_a", transposeA = false, transposeB = false);
  i"AddN.1" = add(i"AddN.0", i"dilation_layer_2-dilation_rate_4-1x1_conv_skip-conv1d/convolution/Conv2D.matmul");
  i"dilation_layer_2-dilation_rate_4-1x1_conv_transform-conv1d/convolution/Conv2D.matmul_a" = variable<scalar>(label = "wavenet_2/dilation_layer_2-dilation_rate_4-1x1_conv_transform-conv1d/convolution/Conv2D.matmul_a", shape = [64, 16]);
  i"dilation_layer_2-dilation_rate_4-1x1_conv_transform-conv1d/convolution/Conv2D.matmul" = matmul(mul_2, i"dilation_layer_2-dilation_rate_4-1x1_conv_transform-conv1d/convolution/Conv2D.matmul_a", transposeA = false, transposeB = false);
  add_2 = add(i"dilation_layer_2-dilation_rate_4-1x1_conv_transform-conv1d/convolution/Conv2D.matmul", add_1);
  i"dilation_layer_3-dilation_rate_8-filter-conv1d/convolution/Conv2D.delay" = tract_pulse_delay(add_2, axis = 0, delay = 0, overlap = 16);
  i"dilation_layer_3-dilation_rate_8-filter-conv1d/convolution/Conv2D_input" = transpose(unsqueeze(i"dilation_layer_3-dilation_rate_8-filter-conv1d/convolution/Conv2D.delay", axes = [0]), axes = [0, 2, 1]);
  i"dilation_layer_3-dilation_rate_8-filter-conv1d/convolution/Conv2D_weigths" = variable<scalar>(label = "wavenet_2/dilation_layer_3-dilation_rate_8-filter-conv1d/convolution/Conv2D_weigths", shape = [64, 16, 3]);
  i"dilation_layer_3-dilation_rate_8-filter-conv1d/convolution/Conv2D_conv" = conv(i"dilation_layer_3-dilation_rate_8-filter-conv1d/convolution/Conv2D_input", i"dilation_layer_3-dilation_rate_8-filter-conv1d/convolution/Conv2D_weigths", dilation = [8], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"dilation_layer_3-dilation_rate_8-filter-conv1d/convolution/Conv2D" = squeeze(transpose(i"dilation_layer_3-dilation_rate_8-filter-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]), axes = [0]);
  i"dilation_layer_3-dilation_rate_8-filter-conv1d/Tanh" = tanh(i"dilation_layer_3-dilation_rate_8-filter-conv1d/convolution/Conv2D");
  i"dilation_layer_3-dilation_rate_8-gate-conv1d/convolution/Conv2D_input" = transpose(unsqueeze(i"dilation_layer_3-dilation_rate_8-filter-conv1d/convolution/Conv2D.delay", axes = [0]), axes = [0, 2, 1]);
  i"dilation_layer_3-dilation_rate_8-gate-conv1d/convolution/Conv2D_weigths" = variable<scalar>(label = "wavenet_2/dilation_layer_3-dilation_rate_8-gate-conv1d/convolution/Conv2D_weigths", shape = [64, 16, 3]);
  i"dilation_layer_3-dilation_rate_8-gate-conv1d/convolution/Conv2D_conv" = conv(i"dilation_layer_3-dilation_rate_8-gate-conv1d/convolution/Conv2D_input", i"dilation_layer_3-dilation_rate_8-gate-conv1d/convolution/Conv2D_weigths", dilation = [8], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"dilation_layer_3-dilation_rate_8-gate-conv1d/convolution/Conv2D" = squeeze(transpose(i"dilation_layer_3-dilation_rate_8-gate-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]), axes = [0]);
  i"dilation_layer_3-dilation_rate_8-gate-conv1d/Sigmoid" = sigmoid(i"dilation_layer_3-dilation_rate_8-gate-conv1d/convolution/Conv2D");
  mul_3 = mul(i"dilation_layer_3-dilation_rate_8-filter-conv1d/Tanh", i"dilation_layer_3-dilation_rate_8-gate-conv1d/Sigmoid");
  i"dilation_layer_3-dilation_rate_8-1x1_conv_skip-conv1d/convolution/Conv2D.matmul_a" = variable<scalar>(label = "wavenet_2/dilation_layer_3-dilation_rate_8-1x1_conv_skip-conv1d/convolution/Conv2D.matmul_a", shape = [64, 32]);
  i"dilation_layer_3-dilation_rate_8-1x1_conv_skip-conv1d/convolution/Conv2D.matmul" = matmul(mul_3, i"dilation_layer_3-dilation_rate_8-1x1_conv_skip-conv1d/convolution/Conv2D.matmul_a", transposeA = false, transposeB = false);
  i"AddN.2" = add(i"AddN.1", i"dilation_layer_3-dilation_rate_8-1x1_conv_skip-conv1d/convolution/Conv2D.matmul");
  i"dilation_layer_3-dilation_rate_8-1x1_conv_transform-conv1d/convolution/Conv2D.matmul_a" = variable<scalar>(label = "wavenet_2/dilation_layer_3-dilation_rate_8-1x1_conv_transform-conv1d/convolution/Conv2D.matmul_a", shape = [64, 16]);
  i"dilation_layer_3-dilation_rate_8-1x1_conv_transform-conv1d/convolution/Conv2D.matmul" = matmul(mul_3, i"dilation_layer_3-dilation_rate_8-1x1_conv_transform-conv1d/convolution/Conv2D.matmul_a", transposeA = false, transposeB = false);
  add_3 = add(i"dilation_layer_3-dilation_rate_8-1x1_conv_transform-conv1d/convolution/Conv2D.matmul", add_2);
  i"dilation_layer_4-dilation_rate_1-filter-conv1d/convolution/Conv2D.delay" = tract_pulse_delay(add_3, axis = 0, delay = 0, overlap = 2);
  i"dilation_layer_4-dilation_rate_1-filter-conv1d/convolution/Conv2D_input" = transpose(unsqueeze(i"dilation_layer_4-dilation_rate_1-filter-conv1d/convolution/Conv2D.delay", axes = [0]), axes = [0, 2, 1]);
  i"dilation_layer_4-dilation_rate_1-filter-conv1d/convolution/Conv2D_weigths" = variable<scalar>(label = "wavenet_2/dilation_layer_4-dilation_rate_1-filter-conv1d/convolution/Conv2D_weigths", shape = [64, 16, 3]);
  i"dilation_layer_4-dilation_rate_1-filter-conv1d/convolution/Conv2D_conv" = conv(i"dilation_layer_4-dilation_rate_1-filter-conv1d/convolution/Conv2D_input", i"dilation_layer_4-dilation_rate_1-filter-conv1d/convolution/Conv2D_weigths", dilation = [1], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"dilation_layer_4-dilation_rate_1-filter-conv1d/convolution/Conv2D" = squeeze(transpose(i"dilation_layer_4-dilation_rate_1-filter-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]), axes = [0]);
  i"dilation_layer_4-dilation_rate_1-filter-conv1d/Tanh" = tanh(i"dilation_layer_4-dilation_rate_1-filter-conv1d/convolution/Conv2D");
  i"dilation_layer_4-dilation_rate_1-gate-conv1d/convolution/Conv2D_input" = transpose(unsqueeze(i"dilation_layer_4-dilation_rate_1-filter-conv1d/convolution/Conv2D.delay", axes = [0]), axes = [0, 2, 1]);
  i"dilation_layer_4-dilation_rate_1-gate-conv1d/convolution/Conv2D_weigths" = variable<scalar>(label = "wavenet_2/dilation_layer_4-dilation_rate_1-gate-conv1d/convolution/Conv2D_weigths", shape = [64, 16, 3]);
  i"dilation_layer_4-dilation_rate_1-gate-conv1d/convolution/Conv2D_conv" = conv(i"dilation_layer_4-dilation_rate_1-gate-conv1d/convolution/Conv2D_input", i"dilation_layer_4-dilation_rate_1-gate-conv1d/convolution/Conv2D_weigths", dilation = [1], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"dilation_layer_4-dilation_rate_1-gate-conv1d/convolution/Conv2D" = squeeze(transpose(i"dilation_layer_4-dilation_rate_1-gate-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]), axes = [0]);
  i"dilation_layer_4-dilation_rate_1-gate-conv1d/Sigmoid" = sigmoid(i"dilation_layer_4-dilation_rate_1-gate-conv1d/convolution/Conv2D");
  mul_4 = mul(i"dilation_layer_4-dilation_rate_1-filter-conv1d/Tanh", i"dilation_layer_4-dilation_rate_1-gate-conv1d/Sigmoid");
  i"dilation_layer_4-dilation_rate_1-1x1_conv_skip-conv1d/convolution/Conv2D.matmul_a" = variable<scalar>(label = "wavenet_2/dilation_layer_4-dilation_rate_1-1x1_conv_skip-conv1d/convolution/Conv2D.matmul_a", shape = [64, 32]);
  i"dilation_layer_4-dilation_rate_1-1x1_conv_skip-conv1d/convolution/Conv2D.matmul" = matmul(mul_4, i"dilation_layer_4-dilation_rate_1-1x1_conv_skip-conv1d/convolution/Conv2D.matmul_a", transposeA = false, transposeB = false);
  i"AddN.3" = add(i"AddN.2", i"dilation_layer_4-dilation_rate_1-1x1_conv_skip-conv1d/convolution/Conv2D.matmul");
  i"dilation_layer_4-dilation_rate_1-1x1_conv_transform-conv1d/convolution/Conv2D.matmul_a" = variable<scalar>(label = "wavenet_2/dilation_layer_4-dilation_rate_1-1x1_conv_transform-conv1d/convolution/Conv2D.matmul_a", shape = [64, 16]);
  i"dilation_layer_4-dilation_rate_1-1x1_conv_transform-conv1d/convolution/Conv2D.matmul" = matmul(mul_4, i"dilation_layer_4-dilation_rate_1-1x1_conv_transform-conv1d/convolution/Conv2D.matmul_a", transposeA = false, transposeB = false);
  add_4 = add(i"dilation_layer_4-dilation_rate_1-1x1_conv_transform-conv1d/convolution/Conv2D.matmul", add_3);
  i"dilation_layer_5-dilation_rate_2-filter-conv1d/convolution/Conv2D.delay" = tract_pulse_delay(add_4, axis = 0, delay = 0, overlap = 4);
  i"dilation_layer_5-dilation_rate_2-filter-conv1d/convolution/Conv2D_input" = transpose(unsqueeze(i"dilation_layer_5-dilation_rate_2-filter-conv1d/convolution/Conv2D.delay", axes = [0]), axes = [0, 2, 1]);
  i"dilation_layer_5-dilation_rate_2-filter-conv1d/convolution/Conv2D_weigths" = variable<scalar>(label = "wavenet_2/dilation_layer_5-dilation_rate_2-filter-conv1d/convolution/Conv2D_weigths", shape = [64, 16, 3]);
  i"dilation_layer_5-dilation_rate_2-filter-conv1d/convolution/Conv2D_conv" = conv(i"dilation_layer_5-dilation_rate_2-filter-conv1d/convolution/Conv2D_input", i"dilation_layer_5-dilation_rate_2-filter-conv1d/convolution/Conv2D_weigths", dilation = [2], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"dilation_layer_5-dilation_rate_2-filter-conv1d/convolution/Conv2D" = squeeze(transpose(i"dilation_layer_5-dilation_rate_2-filter-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]), axes = [0]);
  i"dilation_layer_5-dilation_rate_2-filter-conv1d/Tanh" = tanh(i"dilation_layer_5-dilation_rate_2-filter-conv1d/convolution/Conv2D");
  i"dilation_layer_5-dilation_rate_2-gate-conv1d/convolution/Conv2D_input" = transpose(unsqueeze(i"dilation_layer_5-dilation_rate_2-filter-conv1d/convolution/Conv2D.delay", axes = [0]), axes = [0, 2, 1]);
  i"dilation_layer_5-dilation_rate_2-gate-conv1d/convolution/Conv2D_weigths" = variable<scalar>(label = "wavenet_2/dilation_layer_5-dilation_rate_2-gate-conv1d/convolution/Conv2D_weigths", shape = [64, 16, 3]);
  i"dilation_layer_5-dilation_rate_2-gate-conv1d/convolution/Conv2D_conv" = conv(i"dilation_layer_5-dilation_rate_2-gate-conv1d/convolution/Conv2D_input", i"dilation_layer_5-dilation_rate_2-gate-conv1d/convolution/Conv2D_weigths", dilation = [2], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"dilation_layer_5-dilation_rate_2-gate-conv1d/convolution/Conv2D" = squeeze(transpose(i"dilation_layer_5-dilation_rate_2-gate-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]), axes = [0]);
  i"dilation_layer_5-dilation_rate_2-gate-conv1d/Sigmoid" = sigmoid(i"dilation_layer_5-dilation_rate_2-gate-conv1d/convolution/Conv2D");
  mul_5 = mul(i"dilation_layer_5-dilation_rate_2-filter-conv1d/Tanh", i"dilation_layer_5-dilation_rate_2-gate-conv1d/Sigmoid");
  i"dilation_layer_5-dilation_rate_2-1x1_conv_skip-conv1d/convolution/Conv2D.matmul_a" = variable<scalar>(label = "wavenet_2/dilation_layer_5-dilation_rate_2-1x1_conv_skip-conv1d/convolution/Conv2D.matmul_a", shape = [64, 32]);
  i"dilation_layer_5-dilation_rate_2-1x1_conv_skip-conv1d/convolution/Conv2D.matmul" = matmul(mul_5, i"dilation_layer_5-dilation_rate_2-1x1_conv_skip-conv1d/convolution/Conv2D.matmul_a", transposeA = false, transposeB = false);
  i"AddN.4" = add(i"AddN.3", i"dilation_layer_5-dilation_rate_2-1x1_conv_skip-conv1d/convolution/Conv2D.matmul");
  i"dilation_layer_5-dilation_rate_2-1x1_conv_transform-conv1d/convolution/Conv2D.matmul_a" = variable<scalar>(label = "wavenet_2/dilation_layer_5-dilation_rate_2-1x1_conv_transform-conv1d/convolution/Conv2D.matmul_a", shape = [64, 16]);
  i"dilation_layer_5-dilation_rate_2-1x1_conv_transform-conv1d/convolution/Conv2D.matmul" = matmul(mul_5, i"dilation_layer_5-dilation_rate_2-1x1_conv_transform-conv1d/convolution/Conv2D.matmul_a", transposeA = false, transposeB = false);
  add_5 = add(i"dilation_layer_5-dilation_rate_2-1x1_conv_transform-conv1d/convolution/Conv2D.matmul", add_4);
  i"dilation_layer_6-dilation_rate_4-filter-conv1d/convolution/Conv2D.delay" = tract_pulse_delay(add_5, axis = 0, delay = 0, overlap = 8);
  i"dilation_layer_6-dilation_rate_4-filter-conv1d/convolution/Conv2D_input" = transpose(unsqueeze(i"dilation_layer_6-dilation_rate_4-filter-conv1d/convolution/Conv2D.delay", axes = [0]), axes = [0, 2, 1]);
  i"dilation_layer_6-dilation_rate_4-filter-conv1d/convolution/Conv2D_weigths" = variable<scalar>(label = "wavenet_2/dilation_layer_6-dilation_rate_4-filter-conv1d/convolution/Conv2D_weigths", shape = [64, 16, 3]);
  i"dilation_layer_6-dilation_rate_4-filter-conv1d/convolution/Conv2D_conv" = conv(i"dilation_layer_6-dilation_rate_4-filter-conv1d/convolution/Conv2D_input", i"dilation_layer_6-dilation_rate_4-filter-conv1d/convolution/Conv2D_weigths", dilation = [4], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"dilation_layer_6-dilation_rate_4-filter-conv1d/convolution/Conv2D" = squeeze(transpose(i"dilation_layer_6-dilation_rate_4-filter-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]), axes = [0]);
  i"dilation_layer_6-dilation_rate_4-filter-conv1d/Tanh" = tanh(i"dilation_layer_6-dilation_rate_4-filter-conv1d/convolution/Conv2D");
  i"dilation_layer_6-dilation_rate_4-gate-conv1d/convolution/Conv2D_input" = transpose(unsqueeze(i"dilation_layer_6-dilation_rate_4-filter-conv1d/convolution/Conv2D.delay", axes = [0]), axes = [0, 2, 1]);
  i"dilation_layer_6-dilation_rate_4-gate-conv1d/convolution/Conv2D_weigths" = variable<scalar>(label = "wavenet_2/dilation_layer_6-dilation_rate_4-gate-conv1d/convolution/Conv2D_weigths", shape = [64, 16, 3]);
  i"dilation_layer_6-dilation_rate_4-gate-conv1d/convolution/Conv2D_conv" = conv(i"dilation_layer_6-dilation_rate_4-gate-conv1d/convolution/Conv2D_input", i"dilation_layer_6-dilation_rate_4-gate-conv1d/convolution/Conv2D_weigths", dilation = [4], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"dilation_layer_6-dilation_rate_4-gate-conv1d/convolution/Conv2D" = squeeze(transpose(i"dilation_layer_6-dilation_rate_4-gate-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]), axes = [0]);
  i"dilation_layer_6-dilation_rate_4-gate-conv1d/Sigmoid" = sigmoid(i"dilation_layer_6-dilation_rate_4-gate-conv1d/convolution/Conv2D");
  mul_6 = mul(i"dilation_layer_6-dilation_rate_4-filter-conv1d/Tanh", i"dilation_layer_6-dilation_rate_4-gate-conv1d/Sigmoid");
  i"dilation_layer_6-dilation_rate_4-1x1_conv_skip-conv1d/convolution/Conv2D.matmul_a" = variable<scalar>(label = "wavenet_2/dilation_layer_6-dilation_rate_4-1x1_conv_skip-conv1d/convolution/Conv2D.matmul_a", shape = [64, 32]);
  i"dilation_layer_6-dilation_rate_4-1x1_conv_skip-conv1d/convolution/Conv2D.matmul" = matmul(mul_6, i"dilation_layer_6-dilation_rate_4-1x1_conv_skip-conv1d/convolution/Conv2D.matmul_a", transposeA = false, transposeB = false);
  i"AddN.5" = add(i"AddN.4", i"dilation_layer_6-dilation_rate_4-1x1_conv_skip-conv1d/convolution/Conv2D.matmul");
  i"dilation_layer_6-dilation_rate_4-1x1_conv_transform-conv1d/convolution/Conv2D.matmul_a" = variable<scalar>(label = "wavenet_2/dilation_layer_6-dilation_rate_4-1x1_conv_transform-conv1d/convolution/Conv2D.matmul_a", shape = [64, 16]);
  i"dilation_layer_6-dilation_rate_4-1x1_conv_transform-conv1d/convolution/Conv2D.matmul" = matmul(mul_6, i"dilation_layer_6-dilation_rate_4-1x1_conv_transform-conv1d/convolution/Conv2D.matmul_a", transposeA = false, transposeB = false);
  add_6 = add(i"dilation_layer_6-dilation_rate_4-1x1_conv_transform-conv1d/convolution/Conv2D.matmul", add_5);
  i"dilation_layer_7-dilation_rate_8-filter-conv1d/convolution/Conv2D.delay" = tract_pulse_delay(add_6, axis = 0, delay = 0, overlap = 16);
  i"dilation_layer_7-dilation_rate_8-filter-conv1d/convolution/Conv2D_input" = transpose(unsqueeze(i"dilation_layer_7-dilation_rate_8-filter-conv1d/convolution/Conv2D.delay", axes = [0]), axes = [0, 2, 1]);
  i"dilation_layer_7-dilation_rate_8-filter-conv1d/convolution/Conv2D_weigths" = variable<scalar>(label = "wavenet_2/dilation_layer_7-dilation_rate_8-filter-conv1d/convolution/Conv2D_weigths", shape = [64, 16, 3]);
  i"dilation_layer_7-dilation_rate_8-filter-conv1d/convolution/Conv2D_conv" = conv(i"dilation_layer_7-dilation_rate_8-filter-conv1d/convolution/Conv2D_input", i"dilation_layer_7-dilation_rate_8-filter-conv1d/convolution/Conv2D_weigths", dilation = [8], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"dilation_layer_7-dilation_rate_8-filter-conv1d/convolution/Conv2D" = squeeze(transpose(i"dilation_layer_7-dilation_rate_8-filter-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]), axes = [0]);
  i"dilation_layer_7-dilation_rate_8-filter-conv1d/Tanh" = tanh(i"dilation_layer_7-dilation_rate_8-filter-conv1d/convolution/Conv2D");
  i"dilation_layer_7-dilation_rate_8-gate-conv1d/convolution/Conv2D_input" = transpose(unsqueeze(i"dilation_layer_7-dilation_rate_8-filter-conv1d/convolution/Conv2D.delay", axes = [0]), axes = [0, 2, 1]);
  i"dilation_layer_7-dilation_rate_8-gate-conv1d/convolution/Conv2D_weigths" = variable<scalar>(label = "wavenet_2/dilation_layer_7-dilation_rate_8-gate-conv1d/convolution/Conv2D_weigths", shape = [64, 16, 3]);
  i"dilation_layer_7-dilation_rate_8-gate-conv1d/convolution/Conv2D_conv" = conv(i"dilation_layer_7-dilation_rate_8-gate-conv1d/convolution/Conv2D_input", i"dilation_layer_7-dilation_rate_8-gate-conv1d/convolution/Conv2D_weigths", dilation = [8], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"dilation_layer_7-dilation_rate_8-gate-conv1d/convolution/Conv2D" = squeeze(transpose(i"dilation_layer_7-dilation_rate_8-gate-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]), axes = [0]);
  i"dilation_layer_7-dilation_rate_8-gate-conv1d/Sigmoid" = sigmoid(i"dilation_layer_7-dilation_rate_8-gate-conv1d/convolution/Conv2D");
  mul_7 = mul(i"dilation_layer_7-dilation_rate_8-filter-conv1d/Tanh", i"dilation_layer_7-dilation_rate_8-gate-conv1d/Sigmoid");
  i"dilation_layer_7-dilation_rate_8-1x1_conv_skip-conv1d/convolution/Conv2D.matmul_a" = variable<scalar>(label = "wavenet_2/dilation_layer_7-dilation_rate_8-1x1_conv_skip-conv1d/convolution/Conv2D.matmul_a", shape = [64, 32]);
  i"dilation_layer_7-dilation_rate_8-1x1_conv_skip-conv1d/convolution/Conv2D.matmul" = matmul(mul_7, i"dilation_layer_7-dilation_rate_8-1x1_conv_skip-conv1d/convolution/Conv2D.matmul_a", transposeA = false, transposeB = false);
  i"AddN.6" = add(i"AddN.5", i"dilation_layer_7-dilation_rate_8-1x1_conv_skip-conv1d/convolution/Conv2D.matmul");
  i"dilation_layer_7-dilation_rate_8-1x1_conv_transform-conv1d/convolution/Conv2D.matmul_a" = variable<scalar>(label = "wavenet_2/dilation_layer_7-dilation_rate_8-1x1_conv_transform-conv1d/convolution/Conv2D.matmul_a", shape = [64, 16]);
  i"dilation_layer_7-dilation_rate_8-1x1_conv_transform-conv1d/convolution/Conv2D.matmul" = matmul(mul_7, i"dilation_layer_7-dilation_rate_8-1x1_conv_transform-conv1d/convolution/Conv2D.matmul_a", transposeA = false, transposeB = false);
  add_7 = add(i"dilation_layer_7-dilation_rate_8-1x1_conv_transform-conv1d/convolution/Conv2D.matmul", add_6);
  i"dilation_layer_8-dilation_rate_1-filter-conv1d/convolution/Conv2D.delay" = tract_pulse_delay(add_7, axis = 0, delay = 0, overlap = 2);
  i"dilation_layer_8-dilation_rate_1-filter-conv1d/convolution/Conv2D_input" = transpose(unsqueeze(i"dilation_layer_8-dilation_rate_1-filter-conv1d/convolution/Conv2D.delay", axes = [0]), axes = [0, 2, 1]);
  i"dilation_layer_8-dilation_rate_1-filter-conv1d/convolution/Conv2D_weigths" = variable<scalar>(label = "wavenet_2/dilation_layer_8-dilation_rate_1-filter-conv1d/convolution/Conv2D_weigths", shape = [64, 16, 3]);
  i"dilation_layer_8-dilation_rate_1-filter-conv1d/convolution/Conv2D_conv" = conv(i"dilation_layer_8-dilation_rate_1-filter-conv1d/convolution/Conv2D_input", i"dilation_layer_8-dilation_rate_1-filter-conv1d/convolution/Conv2D_weigths", dilation = [1], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"dilation_layer_8-dilation_rate_1-filter-conv1d/convolution/Conv2D" = squeeze(transpose(i"dilation_layer_8-dilation_rate_1-filter-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]), axes = [0]);
  i"dilation_layer_8-dilation_rate_1-filter-conv1d/Tanh" = tanh(i"dilation_layer_8-dilation_rate_1-filter-conv1d/convolution/Conv2D");
  i"dilation_layer_8-dilation_rate_1-gate-conv1d/convolution/Conv2D_input" = transpose(unsqueeze(i"dilation_layer_8-dilation_rate_1-filter-conv1d/convolution/Conv2D.delay", axes = [0]), axes = [0, 2, 1]);
  i"dilation_layer_8-dilation_rate_1-gate-conv1d/convolution/Conv2D_weigths" = variable<scalar>(label = "wavenet_2/dilation_layer_8-dilation_rate_1-gate-conv1d/convolution/Conv2D_weigths", shape = [64, 16, 3]);
  i"dilation_layer_8-dilation_rate_1-gate-conv1d/convolution/Conv2D_conv" = conv(i"dilation_layer_8-dilation_rate_1-gate-conv1d/convolution/Conv2D_input", i"dilation_layer_8-dilation_rate_1-gate-conv1d/convolution/Conv2D_weigths", dilation = [1], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"dilation_layer_8-dilation_rate_1-gate-conv1d/convolution/Conv2D" = squeeze(transpose(i"dilation_layer_8-dilation_rate_1-gate-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]), axes = [0]);
  i"dilation_layer_8-dilation_rate_1-gate-conv1d/Sigmoid" = sigmoid(i"dilation_layer_8-dilation_rate_1-gate-conv1d/convolution/Conv2D");
  mul_8 = mul(i"dilation_layer_8-dilation_rate_1-filter-conv1d/Tanh", i"dilation_layer_8-dilation_rate_1-gate-conv1d/Sigmoid");
  i"dilation_layer_8-dilation_rate_1-1x1_conv_skip-conv1d/convolution/Conv2D.matmul_a" = variable<scalar>(label = "wavenet_2/dilation_layer_8-dilation_rate_1-1x1_conv_skip-conv1d/convolution/Conv2D.matmul_a", shape = [64, 32]);
  i"dilation_layer_8-dilation_rate_1-1x1_conv_skip-conv1d/convolution/Conv2D.matmul" = matmul(mul_8, i"dilation_layer_8-dilation_rate_1-1x1_conv_skip-conv1d/convolution/Conv2D.matmul_a", transposeA = false, transposeB = false);
  i"AddN.7" = add(i"AddN.6", i"dilation_layer_8-dilation_rate_1-1x1_conv_skip-conv1d/convolution/Conv2D.matmul");
  i"dilation_layer_8-dilation_rate_1-1x1_conv_transform-conv1d/convolution/Conv2D.matmul_a" = variable<scalar>(label = "wavenet_2/dilation_layer_8-dilation_rate_1-1x1_conv_transform-conv1d/convolution/Conv2D.matmul_a", shape = [64, 16]);
  i"dilation_layer_8-dilation_rate_1-1x1_conv_transform-conv1d/convolution/Conv2D.matmul" = matmul(mul_8, i"dilation_layer_8-dilation_rate_1-1x1_conv_transform-conv1d/convolution/Conv2D.matmul_a", transposeA = false, transposeB = false);
  add_8 = add(i"dilation_layer_8-dilation_rate_1-1x1_conv_transform-conv1d/convolution/Conv2D.matmul", add_7);
  i"dilation_layer_9-dilation_rate_2-filter-conv1d/convolution/Conv2D.delay" = tract_pulse_delay(add_8, axis = 0, delay = 0, overlap = 4);
  i"dilation_layer_9-dilation_rate_2-filter-conv1d/convolution/Conv2D_input" = transpose(unsqueeze(i"dilation_layer_9-dilation_rate_2-filter-conv1d/convolution/Conv2D.delay", axes = [0]), axes = [0, 2, 1]);
  i"dilation_layer_9-dilation_rate_2-filter-conv1d/convolution/Conv2D_weigths" = variable<scalar>(label = "wavenet_2/dilation_layer_9-dilation_rate_2-filter-conv1d/convolution/Conv2D_weigths", shape = [64, 16, 3]);
  i"dilation_layer_9-dilation_rate_2-filter-conv1d/convolution/Conv2D_conv" = conv(i"dilation_layer_9-dilation_rate_2-filter-conv1d/convolution/Conv2D_input", i"dilation_layer_9-dilation_rate_2-filter-conv1d/convolution/Conv2D_weigths", dilation = [2], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"dilation_layer_9-dilation_rate_2-filter-conv1d/convolution/Conv2D" = squeeze(transpose(i"dilation_layer_9-dilation_rate_2-filter-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]), axes = [0]);
  i"dilation_layer_9-dilation_rate_2-filter-conv1d/Tanh" = tanh(i"dilation_layer_9-dilation_rate_2-filter-conv1d/convolution/Conv2D");
  i"dilation_layer_9-dilation_rate_2-gate-conv1d/convolution/Conv2D_input" = transpose(unsqueeze(i"dilation_layer_9-dilation_rate_2-filter-conv1d/convolution/Conv2D.delay", axes = [0]), axes = [0, 2, 1]);
  i"dilation_layer_9-dilation_rate_2-gate-conv1d/convolution/Conv2D_weigths" = variable<scalar>(label = "wavenet_2/dilation_layer_9-dilation_rate_2-gate-conv1d/convolution/Conv2D_weigths", shape = [64, 16, 3]);
  i"dilation_layer_9-dilation_rate_2-gate-conv1d/convolution/Conv2D_conv" = conv(i"dilation_layer_9-dilation_rate_2-gate-conv1d/convolution/Conv2D_input", i"dilation_layer_9-dilation_rate_2-gate-conv1d/convolution/Conv2D_weigths", dilation = [2], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"dilation_layer_9-dilation_rate_2-gate-conv1d/convolution/Conv2D" = squeeze(transpose(i"dilation_layer_9-dilation_rate_2-gate-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]), axes = [0]);
  i"dilation_layer_9-dilation_rate_2-gate-conv1d/Sigmoid" = sigmoid(i"dilation_layer_9-dilation_rate_2-gate-conv1d/convolution/Conv2D");
  mul_9 = mul(i"dilation_layer_9-dilation_rate_2-filter-conv1d/Tanh", i"dilation_layer_9-dilation_rate_2-gate-conv1d/Sigmoid");
  i"dilation_layer_9-dilation_rate_2-1x1_conv_skip-conv1d/convolution/Conv2D.matmul_a" = variable<scalar>(label = "wavenet_2/dilation_layer_9-dilation_rate_2-1x1_conv_skip-conv1d/convolution/Conv2D.matmul_a", shape = [64, 32]);
  i"dilation_layer_9-dilation_rate_2-1x1_conv_skip-conv1d/convolution/Conv2D.matmul" = matmul(mul_9, i"dilation_layer_9-dilation_rate_2-1x1_conv_skip-conv1d/convolution/Conv2D.matmul_a", transposeA = false, transposeB = false);
  i"AddN.8" = add(i"AddN.7", i"dilation_layer_9-dilation_rate_2-1x1_conv_skip-conv1d/convolution/Conv2D.matmul");
  i"dilation_layer_9-dilation_rate_2-1x1_conv_transform-conv1d/convolution/Conv2D.matmul_a" = variable<scalar>(label = "wavenet_2/dilation_layer_9-dilation_rate_2-1x1_conv_transform-conv1d/convolution/Conv2D.matmul_a", shape = [64, 16]);
  i"dilation_layer_9-dilation_rate_2-1x1_conv_transform-conv1d/convolution/Conv2D.matmul" = matmul(mul_9, i"dilation_layer_9-dilation_rate_2-1x1_conv_transform-conv1d/convolution/Conv2D.matmul_a", transposeA = false, transposeB = false);
  add_9 = add(i"dilation_layer_9-dilation_rate_2-1x1_conv_transform-conv1d/convolution/Conv2D.matmul", add_8);
  i"dilation_layer_10-dilation_rate_4-filter-conv1d/convolution/Conv2D.delay" = tract_pulse_delay(add_9, axis = 0, delay = 0, overlap = 8);
  i"dilation_layer_10-dilation_rate_4-filter-conv1d/convolution/Conv2D_input" = transpose(unsqueeze(i"dilation_layer_10-dilation_rate_4-filter-conv1d/convolution/Conv2D.delay", axes = [0]), axes = [0, 2, 1]);
  i"dilation_layer_10-dilation_rate_4-filter-conv1d/convolution/Conv2D_weigths" = variable<scalar>(label = "wavenet_2/dilation_layer_10-dilation_rate_4-filter-conv1d/convolution/Conv2D_weigths", shape = [64, 16, 3]);
  i"dilation_layer_10-dilation_rate_4-filter-conv1d/convolution/Conv2D_conv" = conv(i"dilation_layer_10-dilation_rate_4-filter-conv1d/convolution/Conv2D_input", i"dilation_layer_10-dilation_rate_4-filter-conv1d/convolution/Conv2D_weigths", dilation = [4], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"dilation_layer_10-dilation_rate_4-filter-conv1d/convolution/Conv2D" = squeeze(transpose(i"dilation_layer_10-dilation_rate_4-filter-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]), axes = [0]);
  i"dilation_layer_10-dilation_rate_4-filter-conv1d/Tanh" = tanh(i"dilation_layer_10-dilation_rate_4-filter-conv1d/convolution/Conv2D");
  i"dilation_layer_10-dilation_rate_4-gate-conv1d/convolution/Conv2D_input" = transpose(unsqueeze(i"dilation_layer_10-dilation_rate_4-filter-conv1d/convolution/Conv2D.delay", axes = [0]), axes = [0, 2, 1]);
  i"dilation_layer_10-dilation_rate_4-gate-conv1d/convolution/Conv2D_weigths" = variable<scalar>(label = "wavenet_2/dilation_layer_10-dilation_rate_4-gate-conv1d/convolution/Conv2D_weigths", shape = [64, 16, 3]);
  i"dilation_layer_10-dilation_rate_4-gate-conv1d/convolution/Conv2D_conv" = conv(i"dilation_layer_10-dilation_rate_4-gate-conv1d/convolution/Conv2D_input", i"dilation_layer_10-dilation_rate_4-gate-conv1d/convolution/Conv2D_weigths", dilation = [4], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"dilation_layer_10-dilation_rate_4-gate-conv1d/convolution/Conv2D" = squeeze(transpose(i"dilation_layer_10-dilation_rate_4-gate-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]), axes = [0]);
  i"dilation_layer_10-dilation_rate_4-gate-conv1d/Sigmoid" = sigmoid(i"dilation_layer_10-dilation_rate_4-gate-conv1d/convolution/Conv2D");
  mul_10 = mul(i"dilation_layer_10-dilation_rate_4-filter-conv1d/Tanh", i"dilation_layer_10-dilation_rate_4-gate-conv1d/Sigmoid");
  i"dilation_layer_10-dilation_rate_4-1x1_conv_skip-conv1d/convolution/Conv2D.matmul_a" = variable<scalar>(label = "wavenet_2/dilation_layer_10-dilation_rate_4-1x1_conv_skip-conv1d/convolution/Conv2D.matmul_a", shape = [64, 32]);
  i"dilation_layer_10-dilation_rate_4-1x1_conv_skip-conv1d/convolution/Conv2D.matmul" = matmul(mul_10, i"dilation_layer_10-dilation_rate_4-1x1_conv_skip-conv1d/convolution/Conv2D.matmul_a", transposeA = false, transposeB = false);
  i"AddN.9" = add(i"AddN.8", i"dilation_layer_10-dilation_rate_4-1x1_conv_skip-conv1d/convolution/Conv2D.matmul");
  i"dilation_layer_10-dilation_rate_4-1x1_conv_transform-conv1d/convolution/Conv2D.matmul_a" = variable<scalar>(label = "wavenet_2/dilation_layer_10-dilation_rate_4-1x1_conv_transform-conv1d/convolution/Conv2D.matmul_a", shape = [64, 16]);
  i"dilation_layer_10-dilation_rate_4-1x1_conv_transform-conv1d/convolution/Conv2D.matmul" = matmul(mul_10, i"dilation_layer_10-dilation_rate_4-1x1_conv_transform-conv1d/convolution/Conv2D.matmul_a", transposeA = false, transposeB = false);
  add_10 = add(i"dilation_layer_10-dilation_rate_4-1x1_conv_transform-conv1d/convolution/Conv2D.matmul", add_9);
  i"dilation_layer_11-dilation_rate_8-filter-conv1d/convolution/Conv2D.delay" = tract_pulse_delay(add_10, axis = 0, delay = 0, overlap = 16);
  i"dilation_layer_11-dilation_rate_8-filter-conv1d/convolution/Conv2D_input" = transpose(unsqueeze(i"dilation_layer_11-dilation_rate_8-filter-conv1d/convolution/Conv2D.delay", axes = [0]), axes = [0, 2, 1]);
  i"dilation_layer_11-dilation_rate_8-filter-conv1d/convolution/Conv2D_weigths" = variable<scalar>(label = "wavenet_2/dilation_layer_11-dilation_rate_8-filter-conv1d/convolution/Conv2D_weigths", shape = [64, 16, 3]);
  i"dilation_layer_11-dilation_rate_8-filter-conv1d/convolution/Conv2D_conv" = conv(i"dilation_layer_11-dilation_rate_8-filter-conv1d/convolution/Conv2D_input", i"dilation_layer_11-dilation_rate_8-filter-conv1d/convolution/Conv2D_weigths", dilation = [8], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"dilation_layer_11-dilation_rate_8-filter-conv1d/convolution/Conv2D" = squeeze(transpose(i"dilation_layer_11-dilation_rate_8-filter-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]), axes = [0]);
  i"dilation_layer_11-dilation_rate_8-filter-conv1d/Tanh" = tanh(i"dilation_layer_11-dilation_rate_8-filter-conv1d/convolution/Conv2D");
  i"dilation_layer_11-dilation_rate_8-gate-conv1d/convolution/Conv2D_input" = transpose(unsqueeze(i"dilation_layer_11-dilation_rate_8-filter-conv1d/convolution/Conv2D.delay", axes = [0]), axes = [0, 2, 1]);
  i"dilation_layer_11-dilation_rate_8-gate-conv1d/convolution/Conv2D_weigths" = variable<scalar>(label = "wavenet_2/dilation_layer_11-dilation_rate_8-gate-conv1d/convolution/Conv2D_weigths", shape = [64, 16, 3]);
  i"dilation_layer_11-dilation_rate_8-gate-conv1d/convolution/Conv2D_conv" = conv(i"dilation_layer_11-dilation_rate_8-gate-conv1d/convolution/Conv2D_input", i"dilation_layer_11-dilation_rate_8-gate-conv1d/convolution/Conv2D_weigths", dilation = [8], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"dilation_layer_11-dilation_rate_8-gate-conv1d/convolution/Conv2D" = squeeze(transpose(i"dilation_layer_11-dilation_rate_8-gate-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]), axes = [0]);
  i"dilation_layer_11-dilation_rate_8-gate-conv1d/Sigmoid" = sigmoid(i"dilation_layer_11-dilation_rate_8-gate-conv1d/convolution/Conv2D");
  mul_11 = mul(i"dilation_layer_11-dilation_rate_8-filter-conv1d/Tanh", i"dilation_layer_11-dilation_rate_8-gate-conv1d/Sigmoid");
  i"dilation_layer_11-dilation_rate_8-1x1_conv_skip-conv1d/convolution/Conv2D.matmul_a" = variable<scalar>(label = "wavenet_2/dilation_layer_11-dilation_rate_8-1x1_conv_skip-conv1d/convolution/Conv2D.matmul_a", shape = [64, 32]);
  i"dilation_layer_11-dilation_rate_8-1x1_conv_skip-conv1d/convolution/Conv2D.matmul" = matmul(mul_11, i"dilation_layer_11-dilation_rate_8-1x1_conv_skip-conv1d/convolution/Conv2D.matmul_a", transposeA = false, transposeB = false);
  i"AddN.10" = add(i"AddN.9", i"dilation_layer_11-dilation_rate_8-1x1_conv_skip-conv1d/convolution/Conv2D.matmul");
  i"dilation_layer_11-dilation_rate_8-1x1_conv_transform-conv1d/convolution/Conv2D.matmul_a" = variable<scalar>(label = "wavenet_2/dilation_layer_11-dilation_rate_8-1x1_conv_transform-conv1d/convolution/Conv2D.matmul_a", shape = [64, 16]);
  i"dilation_layer_11-dilation_rate_8-1x1_conv_transform-conv1d/convolution/Conv2D.matmul" = matmul(mul_11, i"dilation_layer_11-dilation_rate_8-1x1_conv_transform-conv1d/convolution/Conv2D.matmul_a", transposeA = false, transposeB = false);
  add_11 = add(i"dilation_layer_11-dilation_rate_8-1x1_conv_transform-conv1d/convolution/Conv2D.matmul", add_10);
  i"dilation_layer_12-dilation_rate_1-filter-conv1d/convolution/Conv2D.delay" = tract_pulse_delay(add_11, axis = 0, delay = 0, overlap = 2);
  i"dilation_layer_12-dilation_rate_1-filter-conv1d/convolution/Conv2D_input" = transpose(unsqueeze(i"dilation_layer_12-dilation_rate_1-filter-conv1d/convolution/Conv2D.delay", axes = [0]), axes = [0, 2, 1]);
  i"dilation_layer_12-dilation_rate_1-filter-conv1d/convolution/Conv2D_weigths" = variable<scalar>(label = "wavenet_2/dilation_layer_12-dilation_rate_1-filter-conv1d/convolution/Conv2D_weigths", shape = [64, 16, 3]);
  i"dilation_layer_12-dilation_rate_1-filter-conv1d/convolution/Conv2D_conv" = conv(i"dilation_layer_12-dilation_rate_1-filter-conv1d/convolution/Conv2D_input", i"dilation_layer_12-dilation_rate_1-filter-conv1d/convolution/Conv2D_weigths", dilation = [1], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"dilation_layer_12-dilation_rate_1-filter-conv1d/convolution/Conv2D" = squeeze(transpose(i"dilation_layer_12-dilation_rate_1-filter-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]), axes = [0]);
  i"dilation_layer_12-dilation_rate_1-filter-conv1d/Tanh" = tanh(i"dilation_layer_12-dilation_rate_1-filter-conv1d/convolution/Conv2D");
  i"dilation_layer_12-dilation_rate_1-gate-conv1d/convolution/Conv2D_input" = transpose(unsqueeze(i"dilation_layer_12-dilation_rate_1-filter-conv1d/convolution/Conv2D.delay", axes = [0]), axes = [0, 2, 1]);
  i"dilation_layer_12-dilation_rate_1-gate-conv1d/convolution/Conv2D_weigths" = variable<scalar>(label = "wavenet_2/dilation_layer_12-dilation_rate_1-gate-conv1d/convolution/Conv2D_weigths", shape = [64, 16, 3]);
  i"dilation_layer_12-dilation_rate_1-gate-conv1d/convolution/Conv2D_conv" = conv(i"dilation_layer_12-dilation_rate_1-gate-conv1d/convolution/Conv2D_input", i"dilation_layer_12-dilation_rate_1-gate-conv1d/convolution/Conv2D_weigths", dilation = [1], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"dilation_layer_12-dilation_rate_1-gate-conv1d/convolution/Conv2D" = squeeze(transpose(i"dilation_layer_12-dilation_rate_1-gate-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]), axes = [0]);
  i"dilation_layer_12-dilation_rate_1-gate-conv1d/Sigmoid" = sigmoid(i"dilation_layer_12-dilation_rate_1-gate-conv1d/convolution/Conv2D");
  mul_12 = mul(i"dilation_layer_12-dilation_rate_1-filter-conv1d/Tanh", i"dilation_layer_12-dilation_rate_1-gate-conv1d/Sigmoid");
  i"dilation_layer_12-dilation_rate_1-1x1_conv_skip-conv1d/convolution/Conv2D.matmul_a" = variable<scalar>(label = "wavenet_2/dilation_layer_12-dilation_rate_1-1x1_conv_skip-conv1d/convolution/Conv2D.matmul_a", shape = [64, 32]);
  i"dilation_layer_12-dilation_rate_1-1x1_conv_skip-conv1d/convolution/Conv2D.matmul" = matmul(mul_12, i"dilation_layer_12-dilation_rate_1-1x1_conv_skip-conv1d/convolution/Conv2D.matmul_a", transposeA = false, transposeB = false);
  i"AddN.11" = add(i"AddN.10", i"dilation_layer_12-dilation_rate_1-1x1_conv_skip-conv1d/convolution/Conv2D.matmul");
  i"dilation_layer_12-dilation_rate_1-1x1_conv_transform-conv1d/convolution/Conv2D.matmul_a" = variable<scalar>(label = "wavenet_2/dilation_layer_12-dilation_rate_1-1x1_conv_transform-conv1d/convolution/Conv2D.matmul_a", shape = [64, 16]);
  i"dilation_layer_12-dilation_rate_1-1x1_conv_transform-conv1d/convolution/Conv2D.matmul" = matmul(mul_12, i"dilation_layer_12-dilation_rate_1-1x1_conv_transform-conv1d/convolution/Conv2D.matmul_a", transposeA = false, transposeB = false);
  add_12 = add(i"dilation_layer_12-dilation_rate_1-1x1_conv_transform-conv1d/convolution/Conv2D.matmul", add_11);
  i"dilation_layer_13-dilation_rate_2-filter-conv1d/convolution/Conv2D.delay" = tract_pulse_delay(add_12, axis = 0, delay = 0, overlap = 4);
  i"dilation_layer_13-dilation_rate_2-filter-conv1d/convolution/Conv2D_input" = transpose(unsqueeze(i"dilation_layer_13-dilation_rate_2-filter-conv1d/convolution/Conv2D.delay", axes = [0]), axes = [0, 2, 1]);
  i"dilation_layer_13-dilation_rate_2-filter-conv1d/convolution/Conv2D_weigths" = variable<scalar>(label = "wavenet_2/dilation_layer_13-dilation_rate_2-filter-conv1d/convolution/Conv2D_weigths", shape = [64, 16, 3]);
  i"dilation_layer_13-dilation_rate_2-filter-conv1d/convolution/Conv2D_conv" = conv(i"dilation_layer_13-dilation_rate_2-filter-conv1d/convolution/Conv2D_input", i"dilation_layer_13-dilation_rate_2-filter-conv1d/convolution/Conv2D_weigths", dilation = [2], stride = [1], border = "constant", groups = 1, padding = [(0, 0)]);
  i"dilation_layer_13-dilation_rate_2-filter-conv1d/convolution/Conv2D" = squeeze(transpose(i"dilation_layer_13-dilation_rate_2-filter-conv1d/convolution/Conv2D_conv", axes = [0, 2, 1]), axes = [0]);
  i"dilation_layer_13-dilation_rate_2-filter-conv1d/Tanh" = tanh(i"dilation_layer_13-dilation_rate_2-filter-conv1d/convolution/Conv2D");
  i"dilation_layer_13-dilation_rate_2-gate-conv1d/convolution/Conv2D_input" = transpose(unsqueeze(i"dilation_layer_13-dilation_rate_2-filter-conv1d/convolution/Conv2D.delay", axes = [0]), axes = [0, 2, 1]);
