version 1.0;

extension tract_registry tract_core;

graph nnet(input) -> (output)
{
    input = external<scalar>(shape = [1, 1, 5]);

    # First model is loaded from a tgz archive
    nnet_1_out = tract_core_submodel(input, label = 'nnet1');
    
    # Second model is a quantized model and loaded from a subfolder
    nnet_1_out_quant = tract_core_cast(nnet_1_out);
    nnet_2_out_quant = tract_core_submodel(nnet_1_out_quant, label = 'nnet2');
    nnet_2_out = tract_core_cast(nnet_2_out_quant, to = 'f32');

    output = nnet_2_out;
}
