version 1.0;

graph check_full_padding(input) -> (output)
{
    input = external<scalar>(shape = [1, 1, 3, 3]);
    max = max_pool(input, size = [1, 1, 3, 3],padding = [(0, 0), (0, 0), (1, 1), (1, 1)], border = 'constant', stride = [1, 1, 1, 1], dilation = [1, 1, 1, 1]);
		add_value = [[[[0.0, 0.0, 0.0], [0.0, 0.0, 0.0], [0.0, 0.0, 0.0]]]];
		output = add(max, add_value);
}
