version 1.0;

fragment weights(input: tensor) -> (weights: tensor) {
  weights = external(label =  weights, shape = [1,2,3]);
}

graph network( input ) -> ( output ) {
  input = external(shape = [1, 2, 3]);
  output = weights(input);
}
